[
{"title": "Drafter", "location": "Pottsville, PA", "level": "Entry level", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": ["", "Description:", "Plans mechanical drawings by reviewing sketches, descriptions, specifications, and supporting documents; conferring with engineers and product designers.", "Prepares mechanical sketches and drawings by rendering sectional, auxiliary, and multiviews, sub-assemblies, pictorials, dimensions, and developments; producing two- and three-dimensional orthographic projections using computer aided design (CAD) and pictorial techniques; producing three-dimensional (3-D) models including 3-D and spherical coordinates.", "Prepares mechanical detail drawings by developing applications and calculations of castings, forgings, stampings, machined components, gears, cams, bearings, belt and drive chains, splines, linkages, dies, jogs, hydraulics, and pneumatics; producing fit specifications and geometric dimensioning and tolerancing (GD&T); analyzing force systems in equilibrium, involving loaded beams, columns, trusses, and riveted and welded joints, and internal stresses of loaded members; resolving conflicts between options.", "Prepares supporting information by developing bills of materials; standard parts, and fasteners.", "Modifies drawings by analyzing, resolving, and incorporating changes", "Documents work by recording data and drawings; updating databases.", "Complies with legal requirements by adhering to codes and regulations.", "Keeps equipment operational by adjusting hardware configuration; following manufacturer's instructions and established procedures; calling for repairs.", "Updates job knowledge by participating in educational opportunities; reading technical publications.", "Accomplishes organization goals by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.", "Skills:", "AutoCAD, Drafting, sheet metal, Design", "Top Skills Details:", "AutoCAD, Drafting", "Additional Skills & Qualifications:", "AS Degree is preferred but not a deal breaker", "0-2 years drafting experience", "Experience Level:", "Entry Level", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Manufacturing Training Specialist", "location": "Simi Valley, CA", "level": "Internship", "type": "Full-time", "function": "Human Resources", "description": ["", "Job Description", "We are hiring a Manufacturing Training Specialist to join our team! You will operate machinery and equipment, as well as identify areas of improvement to increase efficiency.", "Responsibilities:", "Operate, maintain and clean manufacturing machinery and equipment", "Deliver company training using proven techniques within learning development, incorporating multiple learning disciplines", "Troubleshoot and repair any mechanical failures", "Complete work orders and requests in a timely fashion", "Perform routine preventative maintenance", "Adhere to safety policies and procedures", "Qualifications:", "Previous experience in production, manufacturing or other related fields", "At least two years of experience with curriculum and training development, including needs assessment and/or instructional design preferred", "Familiarity with schematics and technical drawings", "Familiarity with manufacturing machinery and equipment", "Ability to handle physical workload", "APPLY TODAY START TO WORK TOMORROW."]},
{"title": "Architectural Designer", "location": "Boston, MA", "level": "Entry level", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": ["", "Description:", "Experience with lab or hospital projects is a plus - Experience producing construction documents - Must be proficient with Revit - 3-5+ years of experience in an Architecture firm - Bachelor's Degree - Pursuing Architectural License is a plus", "Skills:", "Design, revit, construction documents, autocad, construction administration, architecture, renderings, Architectural design, Sketchup", "Top Skills Details:", "Design,revit,construction documents", "Additional Skills & Qualifications:", "Comfortable working on projects through all phases of design, from concept through completion - Strong design and graphic presentation skills; ability to present to and interface with clients and consultants - Proficient in architectural design, material & systems detailing and envelope systems design - Experience with construction administration, codes, and regulatory processes - Experience with lab planning and equipment surveying (biology lab, chemistry lab, tissue culture, cleanroom and vivarium) is strongly preferred - Proficient in Revit, AutoCAD, and SketchUp (also Adobe Photoshop and Illustrator) is preferred - Able to self-direct and work well under deadlines, while managing multiple projects and project teams", "Experience Level:", "Intermediate Level", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Entry Level CAD Designer", "location": "Addison, IL", "level": "Entry level", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": ["Awesome opportunity to learn drafting/design and support HVAC Industry!", "Description:", "Roles/Responsibilities:", "Uses computer assisted design/drafting (AutoCAD) equipment and software to develop designs.", "Creates and revises production drawings.", "Makes final sketch of proposed drawing, checking dimension of parts, materials to be used, relation of one part to another, and relation of various parts to whole structure or project.", "Utilizes knowledge of various machines, engineering practices, mathematics, building materials and other physical sciences to complete drawings.", "Drafts detailed multi-view drawings of products.", "Draws finished designs from sketches.", "Updates Drafting and Engineering Standards.", "Sets up and maintain an organized file system for production drawings.", "Converts existing production drawings to AutoCAD Communicates with tooling, QA, engineering and manufacturing regarding new and revised prints.", "Gain working knowledge of carrier by learning the manufacturing process of the product.", "MUST:", "Associates Degree in CAD", "AutoCAD experience", "Drafting/Design experience", "PLUS:", "Sheet metal experience", "Inventor experience", "l", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Program Coordinator", "location": "Altamonte Springs, FL", "level": "Entry level", "type": "Contract", "function": "Other", "description": ["", "Description:", "The Research Services Administrative Specialist-I provides independent administrative and operational support to Office of Research Integrity and Compliance (ORIC) department. The RSAS-I performs a wide range of duties to support ORIC operations at the system level for all markets and divisions. The RSAS-I collaborates with interdisciplinary , utilizing appropriate systems and platforms to maximize department efficiency.", "May provide organization support for daily operations and logistics for any ORIC department, including:", "Support for IRB, Compliance, Regulatory, PRMS, Education and Training, Conflict of Interest and Research Billing teams.", "Coordinates, assists, and monitors the workings of various educational endeavor.", "Serves as a liaison between operations managers, new hires, and the manager of education to facilitate employees receiving all needed training.", "Understands metrics and reporting constructs related to Smartsheet and program management to provide transparency and accurate timely information of key metrics to leaders.", "Assists with short and long-term plans for research training and education needs including planning for resources, comprehensive training programs, new research employee orientation, advanced and professional development opportunities, education activities to enhance adult learning and engagement.", "Supports Manager, Education and Communication administratively upon request including schedule/calendar, correspondence, preparing agendas, presentations, develop training materials, attending and/or facilitating meetings, document and distribute minutes and/or action items, spreadsheets, maintain and organize files, etc.", "Maintains necessary records of attendance, quiz results, certificates issued, overall program effectiveness assessments, and other applicable program records/files.", "Provides back up assistance to the COI Research Compliance Specialist to perform Conflict of Interest tasks.", "Processing of payments, invoices, and purchase orders for ORIC, including IRB member payments, subscriptions, supplies, conference registrations, other ORIC purchases, etc.", "Responsible for maintaining and updating the ORIC calendar, various departmental Outlook email boxes and ORIC intranet website.", "Assisting ORIC Managers and Supervisors with onboarding new employees.", "Perform a wide range of assigned duties in support of total department efficiency.", "Skills:", "Clinical research, Data entry, excel pivot tables", "Top Skills Details:", "Clinical research,Data entry,excel pivot tables", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Loan Specialist (Commercial)", "location": "Palmer, AK", "level": "Entry level", "type": "Full-time", "function": "Finance and Sales", "description": ["Help Help", "Requirements", "", "Conditions of Employment", "You must be a US Citizen or US National", "Males born after 12/31/1959 must be Selective Service registered or exempt", "Subject to satisfactory adjudication of background investigation and/or fingerprint check", "Successful completion of one-year probationary period, unless previously served.", "Direct Deposit - Per Public Law 104-134 all Federal employees are required to have federal payments made by direct deposit to their financial institution", "Successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit E-Verify at https://www.e-verify.gov/", "Qualifications", "Applicants must meet all qualifications and eligibility requirements by the closing date of the announcement including specialized experience and/or education, as defined below.", "Time in grade:", "Applicants must meet one year at the next lower grade to be considered for the next higher grade. (e.g.: one year at the GS-07 grade level for consideration for the GS-09 grade level.)", "For the GS-9 level:", "Applicants must have 1 year of specialized experience equivalent to at least the GS- 07; or its non-Federal equivalent that demonstrates experience assisting higher graded specialists with loan making, servicing and underwriting duties such as regularly examining loan applications, supporting documents and credit reports; experience processing loans up to the point of final approval by a specialist with loan approval authority, maintaining servicing activities of somewhat complex loans and/or grants; assisting higher level loan specialists by performing assigned portions of financial credit analysis with more complex loans as a way of acquiring training and competency for more difficult loan examining and servicing assignments", "OR", "Masters or equivalent graduate degree in a related field,", "OR", "2 full years of progressively higher level graduate education leading to such a degree, or LLB or J.D., if related", "OR", "a combination of education as described and specialized experience.", "For GS-11 level:", "Applicants must have 1 year of specialized experience equivalent to at least the GS-09; or its non-Federal equivalent that demonstrate thorough knowledge and understanding of complex mortgage or business or commercial loan making/servicing and credit principles and practices in order to assess the fundamental soundness of business loans and loans to corporate and/or municipal entities and to independently examine applications and corporate financial documents, and maintain servicing activities on a variety of mortgage and business or commercial loans. Experience may have been gained in work equivalent to analyzing financial information provided by loan applicants, determining eligibility for loans and repayment ability, reviewing and approving applications for businesses or commercial, and/or agricultural bank loans; servicing a loan portfolio of a bank and other loan association: performing financial analysis of commercial concerns for investment purposes; appraising real estate and business property to determine property valuation; or similar work;", "OR", "Ph.D. or equivalent doctoral degree", "OR", "3 full years of progressively higher level graduate education leading to such a degree or LL.M., if related", "OR", "a combination of education as described and specialized experience.", "NOTE:", "To be considered for this position, you must meet all qualification and eligibility requirements for the GS-1165 series set forth in the Office of Personnel Management (OPM) Qualification Standards by the closing date of the announcement. A copy is available at: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards", "Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.", "Education", "A transcript must be submitted with your application if you are basing all or part of your qualifications on education.", "Undergraduate and Graduate Education:", "Major study -- finance, business administration, economics, accounting, insurance, engineering, mathematics, banking and credit, law, real estate operations, statistics, or other fields related to the position, such as agriculture, agricultural economics, farm, livestock or ranch management, or rural sociology.", "Additional Information", "Career Transition Assistance Plan (CTAP), Reemployment Priority List (RPL), or Interagency Career Transition Assistance Plan (ICTAP): Visit the OPM website for information on how to apply as a CTAP, RPL, or ICTAP eligible. To exercise selection priority for this vacancy, CTAP/RPL/ICTAP candidates must meet the basic eligibility requirements and all selective factors. CTAP/ICTAP candidates must be rated and determined to be well qualified (or above) based on an evaluation of the competencies listed in the How You Will Be Evaluated section. When assessed through a score-based category rating method, CTAP/ICTAP applicants must receive a rating of at least 85 out of a possible 100.", "This position is being concurrently announced under Merit Promotion Announcement MP-AK-12325212-2024-CV. Current or former Federal employees or other eligible applicants may apply to both announcements to expand all possibilities of consideration since different referral criteria apply to each type of announcement. See the above announcement for more information.", "To be eligible for appointment to this position, the new hire must be cleared to come on board once the results of the fingerprint check, review of the OF-306, Declaration for Federal Employment, and the candidate's Electronic Questionnaires for Investigations Processing (eQIP) entries have been reviewed and determined to be satisfactory. This position requires a favorable credit check as part of the background investigation.", "Persons with disabilities who require alternative means for communication of program information (Braille, large print, audiotape, etc) should contact: USDA's TARGET Center at 202-720-2600 (voice and TDD).", "If selected, you will be required to submit Form OGE-450 within 30 days of your initial appointment date, and annually thereafter. Selectee is subject to financial Disclosure Requirements in accordance with 5 CFR, Part 2635, Sub part E regarding business or personal transactions with applicants, borrowers, or business contacts who have or who are seeking business with this Agency. Selectee must be able to obtain and maintain a security clearance. If selected you will be subject to a National Agency Check and Inquiry (NACI) and a credit report.", "If you are selected for a position with further promotion potential, you will be placed under a career development plan, and may be non-competitively promoted if you successfully complete the requirements and if recommended by management. However, promotion is neither implied nor guaranteed.", "This position may be eligible to telework up to four days per week, based upon the duties of the position. This position may also be eligible for flexible work arrangements as determined by agency policy and any applicable collective bargaining agreements.", "Read more", "Help Help A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new window Learn more about federal benefits .", "Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered."]},
{"title": "Part-Time Clinical Research Coordinator", "location": "Fort Lauderdale, FL", "level": "Entry level", "type": "Contract", "function": "Research, Analyst, and Information Technology", "description": ["", "Part-Time Clinical Research Coordinator (12 hours - Monday and Thursday)", "This is a short term contract position and requires previous clinical research experience*", "Job Description:", "Looking to hire an", "onsite part time", "individual with clinical research experience to act as a", "consultant CRC", "to support an ongoing", "Cardiovascular", "clinical trial. This CRC must be experienced in being able to work independently. You will act as one of the main CRC’s for this study. Please note, as the position and study progress, additional job duties will likely be added that are not listed in this description. A candidate must help the site and study wherever needed depending on the specific assignment.", "Responsibilities:", "Data entry", "Query resolution", "Source document storage", "Data verification", "E-diary compliance", "Participant follow-up", "Study start up", "Any study efforts deemed necessary by the site", "Qualifications:", "Minimum of two years in a Clinical Research Coordinator role", "Experience with electronic medical records (EMR)", "Experience with electronic data capture (EDC) systems", "Experience with 1572s", "Additional Details:", "Location: Fort Lauderdale, FL - zip code 33312", "Duration: Open ended contract - expected to be 6 months", "Schedule: Onsite 12 hours/week (Monday and Thursday) - during normal business hours", "Hourly pay range: $20-30 per hour", "Start Date: ASAP", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Drafter/designer", "location": "South Windsor, CT", "level": "Entry level", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": ["", "IMMEDIATEY HIRING FOR A DESIGNER/DRAFTER FOR A LEADING MULTIDICIPLINARY ENGINEERING COMPANY IN SOUTH WINDSOR,CT", "APPLY NOW!", "Description:", "Produce 2D and 3D Mechanical drawings for field installation and coordination with other sub-contractor trades.", "Participates in coordination meetings to resolve clashes while maintaining budget and constructability requirements", "Confers with project management staff to resolve issues; reviews drawings with the production and field teams and adjusts as necessary.", "Travel to various project sites as required.", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Regional Account Manager - Hospitality  * Northern Texas Region", "location": "Dallas, TX", "level": "Mid-Senior level", "type": "Full-time", "function": "Sales and Business Development", "description": ["", "Job Details", "Description", "The Wasserstrom Company is the leading Food Service Distributor in the nation. Established in 1902, we are a family owned company with our headquarters in Columbus, Ohio. We have an immediate opening for an Account Manager in our Hospitality Division.", "This outside sales position will initially be responsible for sales activities, from lead generation to close in the Northern Texas region for our growing customer base. They will implement an agreed upon sales strategy which will meet The Wasserstrom Company’s business goals of expanding our base in the customer's marketing areas. They will work with the sales and support teams for the achievement of customer satisfaction and revenue generation in line with company vision and values.", "Duties And Responsibilities", "Interact between store level, regional level and national level buyers in a highly competitive environment.", "Ability to understand and present a conceptual/customized distribution program developed with the customer’s goals in mind.", "Extensive product knowledge and or ability to research in non-food service type products (ie. Décor, merchandising, marketing and signage materials).", "Willingness to learn and understand and work within the customer's culture.", "Ability to manage over 5000 different SKUs throughout multiple regions and departments; understanding lead times and inventory requirements.", "Able to react quickly to respond to daily customer needs and demands.", "Handle large physically demanding check-ins.", "Requirements", "Bachelor’s degree preferred, or an equivalent combination of education and experience.", "Minimum of 2 years proven sales success.", "Knowledge of principles and methods for showing, promoting, and selling products or services. This includes marketing strategy and tactics, product demonstration, sales techniques, and sales control systems.", "Knowledge of principles and processes for providing customer and personal services. This includes customer needs assessment, meeting quality standards for services, and evaluation of customer satisfaction.", "Must have superior communication skills, both verbal and written.", "Knowledge of Microsoft Office programs; Intermediate to level of Excel required.", "Knowledge and experience in the Hospitality industry is desired.", "We offer a competitive salary and outstanding benefits package including major medical, dental, 401(k), and profit sharing. For employment consideration, please complete our online application at www.wasserstrom.jobs .", "AA/EOE", ""]},
{"title": "Interior Designer", "location": "Royal Oak, MI", "level": "Entry level", "type": "Contract", "function": "Design, Art/Creative, and Information Technology", "description": ["", "Description:", "~The Role~", "As an Interior Designer your primary role will be not only create beautiful and exciting spaces, but to generate the documentation to build those spaces. In this role, you will get a well-rounded experience when it comes to the lifespan of a project. Responsibilities include the creation of conceptual renderings, technical documentation, material and furniture selection as well as construction administration. There is a lot of client interaction so great communication skills are a must. It is important to understand how to build the designs you create, so knowledge of construction is important.", "Either lead or assist with projects from initial conception to project completion.", "Manage construction administration for projects that include submittal reviews, RFI responses, site visits to evaluate construction and conformity to design intent, and general coordination and communication with contractors.", "Have a working knowledge of interior code compliance that includes building code and accessible design standards.", "Prepare, coordinate, and complete construction document packages including the creation of finish plans, reflected ceiling plans, architectural floor plans, custom millwork design, finish schedules and fixture schedules needed for construction.", "Assist with interior space planning, and programming of projects.", "Prepare interior design presentations for the design development phase of projects.", "Consult with manufacturers, work and coordinate with external consultants, product representatives, furniture dealers and fabricators.", "Prepare, coordinate, and complete FF&E documentation that includes furniture plans, specifications, and material selections.", "Serve as a resource on interior design issues to others in the office, as well as oversee the design work of others to ensure integrated and cohesive design.", "Efficient and able to meet specific client deadlines and project goals.", "Lead meetings and design charettes with Owners and stake holders.", "Skills:", "Interior design, Design, Architecture, Construction document, Autocad, Revit, Adobe, Space planning, Interior architecture, Space plan, Rendering, Sketchup", "Top Skills Details:", "Interior design, Design, Architecture, Construction document, Autocad, Revit, Adobe", "Additional Skills & Qualifications:", "~Qualifications~", "Eager to learn, self-starter & willing to take initiative", "Outgoing individual with positive attitude", "Strong design and organizational skills as well as high attention to detail", "Communicates in a professional, clear, and concise manner in both verbal and written form", "Ability to work both independently and collaboratively in a team environment", "Knowledge of furniture, finishes, materials, color selections and specifications.", "Graphics and visualization skills to effectively communicate design ideas.", "Ability to produce and coordinate a complete set of construction documents for permitting and bidding on projects", "~MUST HAVES~", "3+ Yrs. Experience", "Revit", "Lumion", "Adobe", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Recent Scientific Grads- Entry Level Lab/Research Positions", "location": "Minneapolis, MN", "level": "Entry level", "type": "Full-time", "function": "Research, Analyst, and Information Technology", "description": ["", "HIRING FOR MULTIPLE LAB TECH OPENINGS - below is an example of one opening I am hiring for! To receive an immediate request for a phone screen, please send resume directly to mshenouda@actalentservices.com.", "Description:", "As a Technologist, one would receive on the job training for the pre-analytical and post-analytical set up and testing of patient samples. This lab is fast paced and performs a variety of testing including therapeutic drug testing and drug screening analysis. The lab performs a mix of high and moderate complexity testing and uses immunoassay methodology with some assays requiring an extraction procedure before analysis.", "Responsibilities:", "Receive specimens for testing; evaluate specimens and test orders; determine priority of work and batches to maintain acceptable turn-around-time; recognize unacceptable and unusual specimens and handle appropriately.", "Adhere to SOP while performing extractions and analysis on client samples, quality control samples and proficiency samples.", "Prepare laboratory reagents and standard solutions according to SOP.", "Evaluate raw and final data for accuracy; recognize and correct errors and unusual results; interpret result to produce a final report; use GDP in all documentation.", "Maintain, calibrate and clean instrumentation; perform scheduled/routine maintenance and critical function checks; recognize significant changes in instrument function; troubleshoot as indicated.", "Follow quality control rules; monitor controls for error detection and take corrective action; maintain laboratory records, maintenance logs, quality control logs, reagent and standard logs, and worksheets.", "Additional Skills & Qualifications:", "Bachelors degree in science related industry (biology, chemistry, biochemistry, medical technology, clinical laboratory science, etc.)", "Close attention to detail", "Excellent research and problem resolution skills", "Proven ability to prioritize tasks and manage time", "Must be able to perform work with a high degree of accuracy and attention to detail", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Interior Designer", "location": "Kalamazoo, MI", "level": "Entry level", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": ["", "Job Description for Interior Designer:", "MUST HAVES:", "Bachelor's Degree in Interior Design", "8+ years of experience within commercial interior design", "Proficient in Revit and Photoshop", "Strong Communication", "Skills:", "Revit, Interior Design, Space Planning, Interior Architecture, Photoshop, Architectural Detailing, AutoCAD, Design, Commercial Interiors", "Interior Designer who is capable of taking projects from start to finish. The primary projects they would be involved on would be K-12, Higher Education and Healthcare. They would mainly be required to do all space planning, architectural detailing, material selection and furniture selection.", "Responsibilities:", "Provide the full range of interior design services on various projects", "Involved with the project delivery process to ensure the highest quality of coordination and documentation", "Develop, assess & document interior finishes pertaining to the design requirements and collaborate with design architects to ensure overall design integrity", "About Actalent", "Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.", "Diversity, Equity & Inclusion", "At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&I are embedded into our culture through:", "Hiring diverse talent", "Maintaining an inclusive environment through persistent self-reflection", "Building a culture of care, engagement, and recognition with clear outcomes", "Ensuring growth opportunities for our people", "The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options."]},
{"title": "Purchasing Manager", "location": "Clearwater, FL", "level": "Mid-Senior level", "type": "Full-time", "function": "Purchasing and Supply Chain", "description": ["", "Job Description", "Job Description", "The Purchasing Manager will manage procurement of all site material (including subcontracts), equipment and services necessary for manufacturing and ensures efficient movement of materials required for meeting production schedules. Review of supplier proposals for price, delivery time and quality. Monitors cost, schedule and performance factors of suppliers and programs to ensure adherence to budgets and customer requirements. Researches and develops sources of supply for required commodities. Directs material procurement and scheduling activities through the use of a computerized ERP System. The ideal candidate will have a desire for continuous improvement both for the organization and for their own professional development.", "Drive to optimum total cost, establish and manage terms and conditions, adhere to established quality standards, product specifications, schedules and Customer requirements and expectations.", "Maintain systemic methods ensuring material visibility and supplier delivery accuracy", "Select, train, and develop subordinates. Assign work for most efficient utilization of personnel, reviewing their activities to assure quality performance.", "Through effective planning and material management, enable leveraged spend and cost savings and strong negotiating positions across the enterprise.", "In collaboration with Supplier Quality, continuously evaluate suppliers and optimize the supplier base through analyses of their capabilities, quality performance, delivery performance, price competitiveness, production rates and tooling availability. Requires knowledge of numerous industries including Aerospace, machining, anodize, NDT, (MRO), etc to ensure that purchased items meet established quality standards and specifications set forth.", "Ensure company procurement policies and procedures required for purchase order terms and conditions, re-determinations, contract terminations and supplier relations and negotiations are followed to maintain compliance with all applicable Government laws including ITAR, DFAR, EAR & FAA Regulations.", "Maintain direct and strong relationships with affiliates, suppliers, internal and externals customer representatives to provide efficient, timely and cost-effective procurement of materials. Keep abreast of innovation and industry trends in supply chain and strategic sourcing.", "Review and approve Purchase Orders for compliance to company procurement policies and procedures, contract requirements, and compliance with all applicable Government laws and regulations. Ensure the efficient resolution of departmental supply chain problems and coordinate problem resolution with all interfacing departments to provide optimum production, quality and delivery of products/services.", "Promote positive employee relations and adherence to company policies and procedures.", "Qualifications:", "CPIM, CPPM, CPP or similar preferred", "Requires a minimum of 5+ years of experience functionally, 3+ years in management, 3+ years in metals manufacturing", "Capability of bridging cultural differences is necessary", "Demonstrated customer-oriented attitude with commitment to going above and beyond in meeting customer requirements", "Strong written and verbal skills are necessary.", "Ability to work as a team", "Strong interpersonal skills and ability to work with demanding customers on a daily basis.", "Familiarity with computerized management systems such as ERP/MRP and familiarity with AS400 system is a plus.", "Company Description", "SMT specializes in precision machined components and assemblies primarily for the aircraft, aerospace, and defense industries.", "We have 23 CNC machines, including 6 horizontal mills (3 of which are on a 23 pallet FMS and 1 has its own 6 pallet system), 1 high speed, 4-axis, vertical mill, 4 vertical mills with capability up to fifth axis positioning, and 13 lathes (some with live tooling). Our 2 most advanced CNC lathes are twin spindle, have twin Y axis turrets with live tooling, and are in a cell with a Fanuc robot.", "Some of our niche capabilities include:", "Complex internal and external deburring and finishing under 10-40x magnification", "Process to create precision .0005\" tolerance bores with less than 16 microfinish, and 11 sigma capability", "Precision surface treatment applications that eliminate the need for masking when parts require a combination of anodize and chemfilm, which results in clear and consistent edges every time.", "SMT specializes in precision machined components and assemblies primarily for the aircraft, aerospace, and defense industries. We have 23 CNC machines, including 6 horizontal mills (3 of which are on a 23 pallet FMS and 1 has its own 6 pallet system), 1 high speed, 4-axis, vertical mill, 4 vertical mills with capability up to fifth axis positioning, and 13 lathes (some with live tooling). Our 2 most advanced CNC lathes are twin spindle, have twin Y axis turrets with live tooling, and are in a cell with a Fanuc robot. Some of our niche capabilities include: -Complex internal and external deburring and finishing under 10-40x magnification -Process to create precision .0005\" tolerance bores with less than 16 microfinish, and 11 sigma capability -Precision surface treatment applications that eliminate the need for masking when parts require a combination of anodize and chemfilm, which results in clear and consistent edges every time."]},
{"title": "Industrial Designer", "location": "Ronkonkoma, NY", "level": "Full-time", "type": "not-found", "function": "not-found", "description": ["", "Requirements:", "Looking for an industrial designer with 0-5 years of applicable work experience in product design, packaging design, display design (POP displays), sourcing, engineering, or a related creative field, with the following:", "Bachelor’s in industrial design or engineering-related discipline.", "Experience with CAD, preferably PTC Creo (SolidWorks acceptable).", "Experience with packaging design software (Artioscad, Engview) is a plus.", "Experience with Graphic Design software (Illustrator, Photoshop).", "Creativity and eye for product design.", "Experience with machine shop, product testing, or quality control are a plus.", "Experience using a flatbed plotter or UV printer is a strong plus.", "Strong communication skills.", "Experience sourcing and coordinating with overseas factories is a plus.", "Ability to speak a 2", "nd", "language is a plus.", "", "Why Carson?", "Carson is a leading consumer optics company, designing a wide variety of products that include binoculars, magnifiers, microscopes, night vision, optical toys, and accessories. Carson’s products are distributed through large national retail chains. The company has a creative culture where everyone is encouraged to contribute to innovation. Carson has a dedicated team of engineers whose sole mission is to improve the customer experience.", "", "About the job:", "The design work for this position is coming up with new product designs and store displays utilizing our flatbed plotter and UV printer. Utilize your communication skills to find and negotiate with new vendors and factories around the world. Help to source new consumer products, from the initial idea to the finished product. Work with engineering to brainstorm new items and create prototypes of your designs. Work with vendors to obtain product samples and costs. Meet with engineering, art, marketing and sales teams and see your designs turn into a reality. This job is most suitable for a self-motivated individual that likes to think outside-of-the-box and has an eye for creativity.", "", "What you will accomplish:", "Gain exposure to aspects of product development including marketing, packaging, and production.", "Research the competitive landscape to help create the next generation of innovative products.", "Help us to identify suitable manufacturing partners. Source components and negotiate costs.", "Discover different methods of manufacturing to improve quality.", "Utilize your creativity to make new and interesting packaging and displays.", "Utilize state of the art machines to create prototypes of your displays.", "Strengthen your communication skills by working with suppliers and factories around the world.", "Champion the product through the development life cycle.", "This should describe you:", "Strong communicator and focused problem solver who works well both in a team setting and individually and has a talent for creativity.", "Passion for product design and hands-on approach to prototyping.", "Confident sharing your own ideas and taking initiative.", "A “no task too small” mentality; and a willingness to learn and tackle any new issue that might arise in any field or arena.", "Ability to research and become an expert on new technologies relevant to the product line.", "Willingness to travel to both domestic and international industry trade shows and to visit overseas vendors.", "Finding pride in making products that will help people, and that people will enjoy.", "", "Requested Documents:", "Please send us your resume.", "Job Type: Full-time", "Work Visa:", "O-1, H-1B, TN, and Green Card sponsorship for all qualified candidates.", ""]}
]