[
{"title": "Global Talent Acquisition Manager", "location": "Irvine, CA", "level": "Mid-Senior level", "type": "Full-time", "function": "Human Resources", "description": ["", "About Us:", "At Assistantly, we are dedicated to pushing boundaries and fostering an environment where innovation thrives. We understand that our people are our greatest asset, and we are committed to attracting, developing, and retaining the best talent worldwide. As we continue to grow, we are looking for a dynamic Global Talent Acquisition Manager to lead our efforts in sculpting a candidate experience that sets us apart and ensures we engage with the finest minds across the globe.", "Role Overview:", "The Global Talent Acquisition Manager will be at the forefront of our efforts to identify, attract, and onboard top-tier talent. This pivotal role demands a strategic thinker with a knack for excellence, ready to redefine our talent acquisition strategy, especially in LATAM, the Philippines, and Eastern Europe. Your mission will be to ensure our talent pool is not just vast but filled with the highest quality candidates, ready to contribute to our ambitious goals.", "Key Responsibilities:", "Elevate Candidate Experience: Craft and implement strategies that enhance our candidate journey, making it second to none. Ensure each touchpoint reflects our brand and values, fostering a positive and engaging experience", "Talent Pool Management: Actively maintain and enrich our global talent pool. Develop a keen understanding of our industry's landscape to strategically position us as the employer of choice for top candidates", "Recruitment Oversight: Lead and support our team of recruiters, providing guidance on open assignments and ensuring alignment with our global talent acquisition strategy. Monitor performance and drive accountability to meet hiring goals", "Global Recruitment: Spearhead recruitment initiatives across LATAM, the Philippines, and Eastern Europe, leveraging your expertise and networks in these regions. Build and maintain relationships with local recruitment agencies and platforms to enhance our reach", "Process and System Enhancement: Evaluate, design, and implement recruitment processes and systems that boost efficiency and effectiveness. Ensure our ATS (Applicant Tracking System) is utilized to its full potential, enhancing data-driven recruitment decisions", "Team Leadership and Development: Inspire and mentor the recruitment team. Foster an environment of continuous learning and development, encouraging innovation and excellence in all recruitment practices", "Why Assistantly?", "We're more than a company; we're a movement. By joining us, you're not just making a career choice; you're making a statement that you believe in the future of work, the power of global talent, and the potential of every individual to contribute to something greater. Ready to run the show and lead us into an exhilarating future? Let's make history together.", "Why Join Us:", "Assistantly offers a unique opportunity to contribute to a rapidly growing organization that values creativity, innovation, and diversity. We provide a platform for you to excel, alongside a team of passionate professionals committed to making a difference. Join us in shaping the future of our industry, one talent at a time.", "Requirements", "What We're Looking For:", "Global Recruitment Experience: Proven track record of successful talent acquisition in LATAM, the Philippines, and Eastern Europe. Familiarity with the nuances of recruiting in these regions is crucial", "Leadership and Strategy: Exceptional leadership skills with the ability to develop and execute a comprehensive global talent acquisition strategy", "Hands-on Approach: Ready to roll up your sleeves and dive deep into operational details. Demonstrated ability to provide immediate impact and value", "Process Innovation: Experience in building, optimizing, and implementing recruitment processes and systems. Proficient in utilizing ATS for streamlined talent management", "Collaborative Mindset: Strong interpersonal and communication skills, capable of building relationships across teams and with external partners globally", "Adaptability and Eagerness to Learn: Open to new challenges, eager to learn, and willing to adapt to the dynamic needs of the business. Ready to start and make a significant impact immediately", "Benefits", "Fully-Remote", "High Bonus Potential + Base", "Generous PTO", "Mission & Value Driven Company", "Opportunity for Internal Growth", ""]},
{"title": "Vice President of Strategic Initiatives - Clinic", "location": "Clearwater, FL", "level": "Executive", "type": "Full-time", "function": "Business Development and Sales", "description": ["", "Job Description", "Do you envision working for a dynamic, mission-driven organization that supports the community while fostering an employee culture of appreciation and fun? If your answer is yes, then an employment opportunity at Directions for Living may be a great fit for you! We offer an excellent salary and benefits package to include employer-paid health insurance premiums for all full-time employees, PTO and paid company holidays, 403b retirement, EAP, and year-round employee wellness and appreciation initiatives.", "Position Summary:", "The Vice President of Strategic Initiatives reports to and is responsible to the President & Chief Executive Officer (CEO) of the agency. The Vice President of Strategic Initiatives participates in the Executive Leadership Team in developing and implementing a mission, vision, and strategic plan for the agency, setting annual objectives for service programs, and ensuring the implementation of action plans to achieve objectives. The Vice President of Strategic Initiatives will partner with his/her peer (VP-level executives) and will be responsible for developing, implementing, and managing, in conjunction with the Vice President of Finance, the operational aspect of the annual budget. The Vice President of Strategic Initiatives represents the agency to all constituencies as designated by the President & CEO. The Vice President of Strategic Initiatives will cultivate existing relationships with public and private funders. Provide effective and inspiring leadership by being actively involved in all programs and services, developing a broad and deep knowledge of all programs Identify opportunities for Directions for Living to leverage cross-program strengths to take advantage of new opportunities and/or to address agency challenges.", "This is a key performance indicator.", "Lead, coach, develop, and retain Directions for Living high-performance senior management team with an emphasis on developing capacity in strategic analysis and planning, and program budgeting", "Directions for Living is an essential services provider. All Directions for Living employees must be willing and able to provide vital support and essential services to the people that we serve in the event of an emergency, pandemic or other disaster situation.", "EDUCATION EXPERIENCE/REQUIREMENTS:", "Must hold a Master's level degree from an accredited program in business, psychology, administration, social work, psychology, nursing, or a related field. At least ten (10) plus years of relevant experience in senior administrative or clinical programming.", "Clinical and supervisory experience with progressive responsibilities for at least five (5) years.", "LCSW or LMHC preferred.", "Previous experience in Child Welfare is a plus.", "EOE/ADA/DFW", "Smoke Free Campus", "Company Description", "Our mission is to be a welcoming and compassionate provider, advocate, and partner to children, adults, and families in need of integrated healthcare, social support, safety, and hope for the future.", "Thriving children. Empowered adults. Strong families.", "Our mission is to be a welcoming and compassionate provider, advocate, and partner to children, adults, and families in need of integrated healthcare, social support, safety, and hope for the future. Thriving children. Empowered adults. Strong families."]},
{"title": "Assistant Administrator (Remote)", "location": "Jacksonville, FL", "level": "Entry level", "type": "Full-time", "function": "Information Technology", "description": ["As a Remote Assistant Administrator - Travel Associate, you will play a crucial role in supporting the efficient functioning of the administrative and travel-related aspects of the organization. This position is remote, requiring a self-motivated and detail-oriented individual who can effectively manage administrative tasks and coordinate travel arrangements for the team.", "Key Responsibilities:", "Administrative Support:", "Handle general administrative tasks such as email correspondence, scheduling meetings, and managing calendars.", "Organize and maintain files, records, and documentation for easy retrieval.", "Assist in preparing reports, presentations, and other documents as needed.", "Travel Coordination:", "Manage travel arrangements, including flight bookings, hotel accommodations, ground transportation, and itineraries.", "Ensure compliance with the organization's travel policies and guidelines.", "Coordinate travel logistics for team members, considering preferences and budget constraints.", "Communication Liaison:", "Serve as a point of contact for internal and external communication related to travel plans and administrative matters.", "Facilitate communication between team members and external stakeholders regarding travel details.", "Expense Management:", "Assist in tracking and managing travel-related expenses.", "Reconcile travel expenses and ensure timely submission of expense reports.", "Remote Support:", "Collaborate with team members working remotely to provide necessary administrative support.", "Utilize virtual communication tools effectively to stay connected with the team.", "Qualifications:", "Strong organizational and time management skills with attention to detail.", "Excellent written and verbal communication skills.", "Proficient in using office productivity tools such as Microsoft Office or Google Workspace.", "Ability to work independently and remotely with minimal supervision.", "Must be eligible to work in the United States.", "Working Conditions:", "This is a remote position, requiring a reliable internet connection and a dedicated workspace.", "Flexible working hours may be required to accommodate different time zones or urgent tasks. Salary: Based off commissions and performance.", "Powered by JazzHR", "43og7W3LCC"]},
{"title": "Internet-Based Hotel Scheduler (Remote)", "location": "United States", "level": "Entry level", "type": "Full-time", "function": "Management and Manufacturing", "description": ["We're on the lookout for a meticulous and customer-centric Remote Hotel Scheduler to join our team. Your primary focus will be on managing room reservations and booking accommodations for our clients. If you possess outstanding communication skills, a warm demeanor, and a love for hospitality, we encourage you to submit your application.", "Responsibilities:", "Handle all aspects of hotel reservations, from receiving inquiries to confirming room availability and making bookings.", "Engage with guests via phone, email, and in-person interactions to address reservation inquiries, modifications, and cancellations.", "Facilitate smooth check-in and check-out experiences for guests, addressing any special requests or concerns they may have.", "Process payments, manage reservations, and issue invoices or receipts as required.", "This role is fully remote, offering you the flexibility to work from the comfort of your own home or any location with an internet connection. We understand the importance of work-life balance and empower you to manage your workload according to your lifestyle.", "Moreover, this position isn't just a job; it's an opportunity to build your own business within our framework. With dedication and hard work, you can shape your financial future while enjoying the support and resources we provide. You'll have the chance to turn your passion for hospitality into a thriving career.", "Here's what we offer:", "One of the highest paid out travel commissions in the industry based on your successful bookings.", "Comprehensive training and ongoing development programs to ensure your success.", "A dynamic and supportive community of like-minded individuals who are passionate about what they do.", "Exposure to a diverse range of projects, from corporate conferences to weddings, allowing you to gain valuable experience and expand your skill set.", "Travel perks, competitive salary, and a flexible remote work environment.", "Qualifications:", "Excellent communication and interpersonal skills, coupled with a welcoming attitude.", "Strong organizational skills and the ability to multitask effectively.", "Attention to detail and accuracy in all tasks.", "Ability to work independently as well as part of a team.", "Proficient knowledge of travel destinations, attractions, and various travel products and services.", "Exceptional customer service and problem-solving abilities.", "A genuine passion for travel and a desire to help others create memorable experiences.", "Must be at least 18 years old and a US resident.", "Join us and embark on an exciting journey where your expertise and hard work are truly valued.", "Powered by JazzHR", "4YpRPVSrCh"]},
{"title": "Executive Assistant", "location": "New York, NY", "level": "Associate", "type": "Full-time", "function": "Administrative", "description": ["", "Join a thriving financial services firm as an Executive Assistant, supporting a Partner and their team in a dynamic and rewarding environment. This role presents an exciting opportunity for a professional who excels in providing high-level administrative support while thriving in a collaborative team setting. This is a full-time, hybrid position offering a competitive base salary of $110,000-120,000 per year, along with additional bonus opportunities.", "On-site Monday - Thursday, remote on Friday", "Hours: 9 am - 5 :30 pm", "Responsibilities:", "Provide proactive and high-level administrative support to a Partner and their team, demonstrating exceptional organizational skills and attention to detail.", "Serve as a gatekeeper, managing phone calls, emails, and correspondence with professionalism and discretion.", "Coordinate complex calendars, including scheduling meetings, appointments, and travel arrangements with precision and efficiency.", "Prepare and distribute a variety of communications, such as agendas, letters, reports, presentations, and confidential documents, maintaining confidentiality at all times.", "Manage general office duties, including ordering supplies, coordinating office maintenance, and overseeing day-to-day operations.", "Coordinate logistics for in-person, virtual, and remote meetings, ensuring seamless execution and a professional experience for all participants.", "Demonstrate flexibility by assisting with ad hoc projects and providing support across various functions as needed.", "Requirements:", "4+ years of experience as an Executive Assistant or in a similar role, demonstrating a track record of success and proficiency in providing high-level support.", "Exceptional written and verbal communication skills, with the ability to interact effectively with executives, colleagues, and external stakeholders.", "Previous experience using Microsoft Teams, Word, Excel, Outlook, and PowerPoint.", "Strong organizational skills and the ability to multitask effectively, maintaining composure and attention to detail in a fast-paced environment.", "Demonstrated discretion and the ability to handle confidential information with integrity and professionalism.", "A proactive and collaborative mindset, with a willingness to take initiative and contribute to team success.", ""]},
{"title": "Senior Marketing Manager", "location": "Charlotte, NC", "level": "Mid-Senior level", "type": "Full-time", "function": "Marketing and Sales", "description": ["", "Company Description", "Truly Good Foods is a family-owned company founded in 1977 by Jerry and Betty York. It is certified in the Women's Business Enterprise National Council (WBENC) and the Women-Owned Small Business Program (WOSB). Our goal is to create the tastiest snacks for families to share for generations. With a product line of more than 3,000 snacks, Truly Good Foods is a nationwide snack partner for businesses. We operate nationwide with sales and distribution offices in Reno, Orlando, Atlanta, Memphis, Washington DC, Dallas, and our headquarters is located in Charlotte, North Carolina.", "Role Description", "Customer Channel Marketing Strategy:", "• Develop and implement comprehensive marketing plans for each foodservice customer channel,", "considering unique demographics and preferences.", "• Manage marketing activities to support and drive key results, sales and profit growth, and account", "penetration. Maximize opportunities in key market segments.", "• Develop detailed project plans and lead cross-functional teams to meet critical deadlines, deliverables,", "and budgets.", "• Assess local sponsorship and partnership opportunities with marketing leadership.", "Marketing Operations Optimization:", "• Facilitate linkage between Hubspot Marketing and Sales capabilities and collaborate to develop digital", "solutions for customer needs.", "• Implement and optimize sales and marketing processes for seamless execution of channel-specific", "campaigns.", "• Work closely with internal teams to ensure efficient workflows and timely delivery of marketing-led", "initiatives.", "Sales Collaboration:", "• Work in tandem with sales teams to understand customer needs, market trends and competitive", "landscape.", "• Collaborate with sales to align channel strategies with revenue and growth targets.", "• Build sales enablement materials and support to enhance campaign effectiveness.", "Brand Development & Positioning:", "• Drive brand development initiatives specific to each customer channel, ensuring consistent messaging", "and positioning.", "• Collaborate with design and content teams to create visually compelling and on-brand materials.", "Analytics & Reporting:", "• Utilize data analytics tools to measure and analyze the performance of marketing campaigns.", "• Provide detailed reports on key performance indicators and actionable insights for continuous", "improvement.", "Qualifications & Experience", "• Bachelor's degree (B. A.) in marketing or related field from four-year college or university; and ten plus", "years related experience in marketing, with specific focus on customer channel marketing within the", "food industry a plus.", "• Minimum 10 years’ experience in marketing, with specific focus on customer channel marketing within", "the food industry a plus", "• Strong strategic thinking, analytical, and problem-solving skills.", "• Excellent leadership, collaboration, and communication abilities.", "• Results-oriented, with strong organizational skills, project management skills, and the ability to multitask.", "• Marketing automation experience preferred, with Hubspot CRM platform expertise a plus.", ""]},
{"title": "Impact Associate", "location": "United States", "level": "Associate", "type": "Full-time", "function": "Other", "description": ["", "General Company Description", "Food Revolution Network (FRN) is committed to healthy, ethical, and sustainable food for all. With more than 1,000,000 members, FRN provides online-based education and advocacy with the goal of transforming food systems to support healthy people and a healthy planet.", "Dedicated to building a sustainable team and business that makes a massive positive impact on people and the planet, FRN is a fully remote company (work from anywhere), offering a 4-day (10-hour day) work week, flexible schedules, and a commitment to team member development, wellness, and sustainability. Read more about us below.", "Description", "Food Revolution Network’s (FRN) Impact Associate (IA) supports the entire Impact Team in advancing FRN’s mission of promoting healthy, ethical, and sustainable food for all. The position is integral to enhancing the engagement and satisfaction of FRN’s WHOLE Life Club (WLC) members, course and event participants, and blog readers. In addition to reporting to and working closely with the Head of Impact (HoI), the IA will work in collaboration with and in support of most of the Impact Team’s “sub-teams,” particularly Community Success, Editorial Content, and Culinary Content.", "As such, the IA is responsible for a wide array of support functions. These include assisting with the planning and execution of content and events, ensuring the seamless maintenance of editorial and culinary content infrastructure, and adopting innovative AI technologies to bolster content creation.", "The role requires a blend of editorial support, community moderation, event coordination, and technical proficiency, ultimately aimed at providing exceptional support and resources to FRN’s members, program participants, and readers. Through diligent work behind the scenes and direct community engagement, the Impact Associate contributes significantly to the realization of FRN’s vision of changing the way the world eats.", "Reports to: Head of Impact", "Requirements", "Core Responsibilities", "Member and Program Support. Work closely with FRN’s Community Success Manager (CSM) and WHOLE Life Club (WLC) and Culinary teams to provide support to our members, course participants, and readers, as well as assume responsibility for behind-the-scenes tasks that ensure the smooth planning and creation of content and events", "Editorial Content Support. Work closely with FRN’s Content Strategist to ensure that all content is accounted for and our editorial calendar and content workflows remain up to date and functioning seamlessly", "Culinary Content Support. Support the smooth flow of recipe development and maintenance for the Culinary Team in FRN’s team drive and our membership platform and website", "Team-wide Support. Work closely with the Head of Impact (HoI) to ensure the smooth functioning of the Impact Team collectively and individually.", "Technology Innovation and AI Integration. Utilize AI tools and methods to enhance content creation, ensuring that new content is closely aligned with brand voice and the latest trends in health, wellness, and environmental sustainability.", "Member and Program Support", "Participate actively in WLC planning meetings to contribute ideas and document processes and decisions", "Maintain the WLC Action of the Week log and other WLC planning documents", "Work with the CSM to draft preliminary WLC monthly and weekly content", "Moderate the WLC community forum, WLC recipe and other pages, course forums, and blog comment threads on weekends; provide additional weekday moderation as needed. Alert appropriate team members of the need for them to respond to posted questions and comments", "Maintain the schedule of live WLC events and carry out related communications tasks", "Work with the CSM and Culinary team to provide participant support during FRN’s annual Food Revolution Summit and other organization-wide live events", "Editorial Content Support", "Collaborate with and provide support to FRN’s Content Strategist by managing the Editorial Calendar, including article idea contributions, due dates, and overall board management. Assist the CS with status flow management as requested", "Create and manage a database, with the oversight of FRN’s Content Strategist, of all of FRN’s content pieces, including blog articles and related assets, videos, guidebooks, products, and interviews", "Maintain established spreadsheet of articles that contain affiliate links", "Culinary Content Support", "Create and maintain individual recipe folders, the Master Recipe Index, as well as any folders and documents created for the culinary portion of various initiatives", "Work with the Culinary Team to run nutritional analyses for recipes and add the data to new and existing recipes", "Update and correct existing recipes in WordPress as needed.", "Create and assign Click Up tasks to the Technology team to correct recipes on FRN’s platform/Member Center and follow up as necessary to ensure they are carried out in a timely manner", "Carry out quality assurance for recipes on FRN’s website", "Team-Wide Support", "Work closely with the Head of Impact (HoI) to maintain team-wide documents, meeting notes, and agendas in alignment with FRN’s standard processes and procedures for drive and document management", "Work closely with each Impact Team member to help them document their regular tasks and activities.", "Cross-train in select activities of the Impact Team’s smaller teams in order to develop a full understanding of the activities of the entire team and to provide occasional backup support", "Identify and share noted gaps in team processes and procedures with the HoI", "Technology Innovation and AI Integration", "AI is a rapidly evolving field, and while not all technologies and applications noted below may be immediately applicable, they illustrate potential future contributions to our work. A component of this role involves staying informed on these evolving AI opportunities, ensuring FRN is poised to integrate beneficial advancements aligning with our goals as they become viable.", "Participate in AI training to gain skills in a range of relevant AI tools", "Utilize AI to assist in the creation of member communications and educational content by suggesting topics, generating initial drafts, and creating interactive educational tools like quizzes or infographics based on the latest nutritional and health research", "Use AI tools developed for FRN to assist in carrying out relevant behind-the-scenes tasks and responsibilities", "Role Skills", "Outstanding communication skills, including writing, proofreading, editing, and interpersonal interactions", "Aptitude for being organized, working within systems, and consistently meeting deadlines", "Keen attention to detail with the ability to efficiently plan and execute tasks", "Demonstrated knowledge of and enthusiasm for whole food plant-based nutrition, recipes, and lifestyle.", "Desire to help others reach their health goals", "Ability to convey both enthusiasm and professionalism in writing and in real-time conversations", "Able to appreciate and interact well with other people, meeting them where they are", "Love of collaborative and independent work", "Interest in AI and willingness to develop skills in using various AI tools to enhance work results", "Proficiency in Google Workspace", "Experience with Content Management Systems", "Working Environment", "Reliable high-speed internet connection", "A quiet, functional, and stable work environment", "Comfortable working with a team via Slack", "Comfortable working with others via Zoom video conferencing", "Comfortable working with AI tools", "Comfortable working within a project management system", "Expert-level proficiency with G Suite products, specifically Docs and Sheets", "Behavioral Competencies", "All FRN team members are expected to adhere to our Global Behavioral Competencies.", "Benefits", "About Us", "Our mission is to inspire and advocate for healthy, ethical, and sustainable food for all through education about plant-powered foods.", "Food Revolution Network is an online-based education and advocacy-driven organization committed to healthy, ethical, and sustainable food for all. Guided by John and Ocean Robbins, we have more than 900,000 members and collaborate with many of the top food revolutionary leaders of our times. Food Revolution Network aims to empower individuals, build community, and transform food systems to support healthy people and a healthy planet.", "We believe that everyone, regardless of the color of their skin or how much money they have, deserves the knowledge and the means to healthfully feed themselves and their family. We’re committed to a world with a true opportunity for everyone to be healthy.", "About You", "You believe in the power of healthy, organic, fair trade, local, plant-strong food to change the world. You’re passionate about supporting the food revolution and movements for a more healthy, ethical, and sustainable world. You support our scientifically grounded, fact-driven, and welcoming approach, which promotes a whole foods, plant-based diet and is inclusive of a broad range of eaters.", "You’re values-driven, highly motivated, self-aware, ethical, emotionally intelligent, multiculturally competent, compassionate, socially conscious, constantly learning, and respectful of yourself and others. You’re reliable, dedicated, undaunted, persistent, friendly, and forthright. You admit your mistakes, clean up your messes, and learn from everything.", "Our Commitment to Equal Opportunity", "Food Revolution Network is a committed equal-opportunity employer. FRN recruits, employs, trains, compensates, and promotes regardless of race, religion, color, national origin, sex, disability, age, veteran status, and other protected status as required by applicable law. At FRN, we aim to be a place where a diverse mix of talented people bring their skills, life experience, passion, and creativity to create a whole that is greater than the sum of its parts. We are committed to healthy, ethical, and sustainable food for ALL, and that requires a proactive dedication to advocating for equity, inclusion, and opportunity, including for those communities that have been most negatively impacted by our toxic food culture. We are committed to equality and believe in diversity of race, gender, sexual orientation, religion, ethnicity, national origin, and all the other characteristics that enable each person to bring unique talents, insights, and skills.", "Work Location", "FRN is a fully remote team, with team members in multiple North American time zones. This position may be performed from anywhere, but we strongly prefer North America-compatible time zones, with a required availability from 9 am - 3 pm Pacific Time, Monday through Thursday.", "Compensation", "$60,000 - $70,000 annual salary, depending on experience.", "Full-time employees also receive paid time off, time off for holidays, wellness time off, health, vision, and dental insurance, opportunities for bonuses, 401k eligibility, and other benefits."]},
{"title": "Hourly Part-Time Tequila Brand Ambassador for Tastings & Demos", "location": "San Diego, CA", "level": "Entry level", "type": "Part-time", "function": "Sales and Business Development", "description": ["", "Job Description", "Perform demos and tastings for retail stores in the San Diego area. Pour tequila samples, educate customers on the key selling points, pass out merch and swag, and promote in-store sales.", "NEED someone for this Friday's 3/29/24 Demo (sampling tequila, hand out swag) from 4-7pm."]},
{"title": "Head of Business Development and M&A (US or London based)", "location": "New York, United States", "level": "Executive", "type": "Full-time", "function": "Business Development and Sales", "description": ["About Us:", "At Peak 21, we specialize in acquiring and incubating direct-to-consumer (DTC) brands globally. With a portfolio of DTC brands generating over $200 million in sales, we are seeking a Head of Business Development and M&A to lead our expansion efforts in the US. Backed by top VCs, we are seeking top talent to drive our business development and M&A strategies", "(US or London based)", ".", "Role Overview:", "We are looking for a strategic and results-driven Head of Business Development and M&A to lead our expansion efforts in the US. The ideal candidate has a network in the DTC space already, 2-3 years of work experience in a startup or DTC company and is hyper-organized.", "Responsibilities:", "Lead business development efforts in the US, identifying and pursuing acquisition opportunities that align with our growth strategy", "Build and maintain relationships with key stakeholders in the DTC space, including founders, investors, and industry experts", "Develop and execute business development and M&A strategies to drive growth and expand our portfolio of brands", "Work closely with the founding team to evaluate potential acquisitions and partnerships, including conducting due diligence and financial analysis", "Stay abreast of industry trends and market developments to identify new opportunities for growth", "Qualifications:", "Bachelor's degree in Business, Finance, or related field;", "Proven track record of success in business development and sales", "Ideally have experience in the DTC and/or startup ecosystem already (not a requirement)", "Exceptionally organized", "Excellent communication and negotiation skills", "Strategic thinker with a results-oriented mindset", "Ability to thrive in a fast-paced, entrepreneurial environment", "Why join Us:", "Opportunity to join a well-funded startup with top-tier investors", "Work with a highly experienced and entrepreneurial team, working directly with the founders", "Competitive compensation package", "Flexible remote work options", "Powered by JazzHR", "Y2cUYH9rIw"]},
{"title": "Content Manager", "location": "United States", "level": "Mid-Senior level", "type": "Part-time", "function": "Marketing, Art/Creative, and Writing/Editing", "description": ["", "Are you passionate about skincare and excited about the idea of revolutionizing the way people approach their skincare routines? Do you have a creative and strategic mind with a knack for engaging content creation? If so, you may be the perfect fit for our Content Manager role at Fin.", "At Fin, we understand the struggle of navigating the world of skincare products and routines. That's why we've created an innovative solution to help people track their skincare journey and truly understand what works for their skin. With our Skin Analysis AI and routine tracking capabilities, we're on a mission to empower individuals to take control of their skincare and achieve real, tangible results.", "As our Content Manager, you'll play a crucial role in shaping the Fin brand and driving engagement with our audience. You'll have the opportunity to develop and implement a content strategy that showcases the value of our app, educates users on skincare best practices, and fosters a sense of community within our user base. You'll also work closely with our marketing team to ensure that our content aligns with our overall brand messaging and goals.", "Key responsibilities:", "- Develop and execute a comprehensive content strategy to drive user engagement and brand awarenessDevelop and execute a comprehensive content strategy to drive user engagement and brand awareness", "- Create and manage a content calendar to ensure consistent, high-quality content across all platformsCreate and manage a content calendar to ensure consistent, high-quality content across all platforms", "- Produce engaging and informative content, including blog posts, social media posts, videos, and moreProduce engaging and informative content, including blog posts, social media posts, videos, and more", "- Collaborate with the marketing team to align content with overall brand messaging and promotional campaignsCollaborate with the marketing team to align content with overall brand messaging and promotional campaigns", "- Monitor and analyze content performance, and use insights to refine and optimize future content effortsMonitor and analyze content performance, and use insights to refine and optimize future content efforts", "- Stay up to date on industry trends and best practices to continuously improve our content strategyStay up to date on industry trends and best practices to continuously improve our content strategy", "Requirements:", "- Proven experience in content creation and management, particularly in the skincare or beauty industryProven experience in content creation and management, particularly in the skincare or beauty industry", "- Strong writing and editing skills, with a keen eye for detail and grammarStrong writing and editing skills, with a keen eye for detail and grammar", "- Proficiency in using content management systems and social media platformsProficiency in using content management systems and social media platforms", "- Ability to think strategically and creatively, with a deep understanding of audience engagementAbility to think strategically and creatively, with a deep understanding of audience engagement", "- Strong project management and organizational skills, with the ability to prioritize and juggle multiple tasksStrong project management and organizational skills, with the ability to prioritize and juggle multiple tasks", "- Part-time availability, with a commitment to delivering high-quality work and meeting deadlinesPart-time availability, with a commitment to delivering high-quality work and meeting deadlines", "If you're ready to join a dynamic team and make a meaningful impact in the skincare industry, we want to hear from you. Apply now and be part of the future of skin health at Fin.", ""]}
]