[
{"title": "Operations Manager", "location": "Portland, Oregon Metropolitan Area", "level": "Associate", "type": "Full-time", "function": "Human Resources and Administrative", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>About Us</strong></p><p>Pepper Foster Consulting is a strategy and project execution consulting firm headquartered in Portland, OR, with offices in Portland; Minneapolis-St. Paul, Minnesota; Atlanta, Georgia; and an M&amp;A practice. We are a values-driven firm with a focus on utilizing local people for local work while also having the ability to provide services coast to coast in the United States internationally as needed. We specialize in helping our clients turn their ideas and concepts into transformative realities, and we exist to make a difference - for our clients, our people, and our communities. Founded in 2015, our consultants have been trusted to advise, elaborate, and lead the strategy, analysis, and execution of a host of mission-critical initiatives and projects for our clients.</p><p><br></p><p><strong>DEI Vision Statement</strong></p><p>Pepper Foster recognizes that diversity, equity and inclusion extends but is not limited to culture, race, religion, veterans, gender, sexual orientation and physical ability. We are inspired by the unique communities where we live and work, and embrace diversity as vital to the health of our organization. We are driven by relentless curiosity and a strong desire to educate ourselves, build awareness and encourage continuous learning. We strive to provide a culture that is open, compassionate and respectful of all people.</p><p><br></p><p><strong>The Position: </strong><em>Operations Manager</em></p><p><br></p><p>To support our growth as one of the Inc 5000 fastest growing companies in America, we are creating the new position of Operations Manager.</p><p><br></p><p>You’ll be part of the HQ team and work directly with the founder and CEO of Pepper Foster Consulting and our executive leadership team to manage and execute our day-to-day operations and critical back office functions. </p><p><br></p><p>This is a hands-on, multifaceted role where you will be responsible for invoicing, bookkeeping, financial reporting, payroll, new employee onboarding, HR and benefits administration, website and marketing administration, new laptop setup, and administering our Google, Microsoft, SalesForce, Employee Navigator, and Bamboo IT systems. </p><p><br></p><p>You will be an invaluable and integral part of the team, at the center of everything, and probably the first person people go to when they need help or have a question. </p><p>You’ll get to experience and grow your skills in just about all of the critical back office functions of a business including Marketing, IT, HR, Finance, Payroll, Employee Growth &amp; Development, and Training. </p><p><br></p><p>As the company grows, so will the operations functions, providing you with opportunities to grow your career; maybe by focusing on one of the functional areas like HR, IT, Finance or Marketing; or maybe by staying in a multifaceted operations role that could one day lead to you becoming a CAO or COO.</p><p> </p><p><strong>The Person</strong>: <em>Fun, Smart, Collaborative, Detail-Oriented, Flexible, Dedicated </em></p><p><br></p><p><strong>Minimum Requirements</strong></p><ul><li>You have at least 2 years of professional experience in a similar multifaceted role within a professional office environment. </li><li>Experience with bookkeeping, payroll, benefits, marketing, and/or IT administration is a big plus.</li><li>Located in the greater Portland area or willing to relocate</li><li>Must be authorized to work in the US without sponsorship</li></ul><p><br></p><p><strong>Preferred Qualifications</strong></p><ul><li>You are fun, smart, honest, passionate, collaborative, humble, thoughtful, flexible, confident, generous, inspiring, great, and happy.</li><li>You are naturally detail-oriented and have high standards for the quality and accuracy of your work. </li><li>You are a fast learner and enjoy figuring stuff out, getting stuff done, and tackling a wide variety of tasks.</li><li>You relish tracking down and fixing problems, working out how to make something work in a system or process, or fit and look good on a website, and sometimes, you lose track of time when you’re writing copy, creating spreadsheets, developing reports, making graphics, or updating websites. </li><li>You are ambitious and keen to grow your career and understand that you have to build your skills and abilities and prove that you have the right stuff to move ahead.</li><li>You naturally look for ways to improve things, streamlining processes and creating reusable templates to make your work easier and more efficient. </li><li>You care about how things are received and look and take pride in making sure your work is received well, looks great, and is of the highest quality it can be.</li><li>You have a natural eye for design and are a great communicator with a writing style that is easily consumed by all and inspires curiosity, interest, and confidence.</li><li>You are flexible and comfortable being uncomfortable, enjoy helping people, and your energy is contagious.</li></ul><p><br></p><p><strong>The Opportunity:</strong> <em>To grow your skills and career at a forward-thinking and rapidly growing firm, working with great people who enjoy making a difference</em></p><p><br></p><p>The reason you’ll join the Pepper Foster team (apart from the fact that we’re awesome) is that you’ll gain visibility into and experience in all of the critical back office functions of a business. </p><p><br></p><p>You’ll be able to grow your skills in a wide variety of functions, work out what you enjoy the most, and take your career forward in a host of different ways. </p><p><br></p><p>Your role will be what keeps the company moving forward and, as a result, you will be at the center of everything. You will get to work directly with and learn from senior leadership and the whole team. </p><p><br></p><p>You’ll be joining a firm that has an amazing culture, great team, celebrated leadership, and a vision for one day being one of the largest and most important companies of the 21st century. </p><p><br></p><p><strong>Benefits of Working for PFC</strong></p><p><br></p><ul><li>Health, Dental, and Vision Insurance</li><li>Life &amp; Disability Insurance</li><li>Flexible Paid Time Off</li><li>8 Flexible Holidays</li><li>Paid Volunteer Time </li><li>Annual Performance Bonus</li><li>FSA Plan</li><li>401(k) Plan with Employer Contribution</li><li>Cell Phone Reimbursement</li><li>Paid Parental Leave &amp; Adoption Benefit</li><li>Stock Options</li><li>Profit Share Points</li><li>$2,500 Annual Professional Development per Employee</li><li>All Expenses Paid Annual Retreat + Monthly Social Activities</li></ul><p><br></p><p>Base Salary Range</p><p>$65,000-$85,000/Annually</p><p><br></p><p>Pepper Foster Consulting is an equal opportunity employer. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</p><p></p>\n        </div>"},
{"title": "Virtual Research & Scheduling Assistant-Entry Level", "location": "United States", "level": "Entry level", "type": "Full-time", "function": "Management and Manufacturing", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          A love of travel attracts many people to the field, but to succeed, a Research &amp; Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research &amp; Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.<br><br>Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.<br><br>We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!<br><br><strong>️Job Description:<br><br></strong><ul><li>Arrange Cruise Travel for vacations, honeymoons, weddings and more</li><li>Determine customer's needs and preferences, such as schedules, costs and payment plans</li><li>Plan and arrange tour packages, excursions, and day trips</li><li>Book reservations for travel, hotel, flights, rental cars, special events, honeymoons <br><br></li></ul><strong>Benefits:<br><br></strong><ul><li>Full Training Provided</li><li>Work PT or FT</li><li>No experience necessary</li><li>Travel Perks</li><li>Licensed &amp; Bonded</li><li>Personal Website</li><li>Daily Training Available</li><li>Certification provided</li><li>Remote Business Opportunity <br><br></li></ul><strong>️Requirements:<br><br></strong><ul><li>Must be 18+</li><li>Computer with good WiFi</li><li>Self Motivated</li><li>Detail Oriented</li><li>Customer Service Skills is a plus <br><br></li></ul>This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business Opportunity<br><br>Join Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel Industry<br><br>Powered by JazzHR<br><br>v7i7JJ9CE1\n        </div>"},
{"title": "Front Desk Receptionist", "location": "New York, NY", "level": "Associate", "type": "Full-time", "function": "Administrative and Purchasing", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>ZARA IS LOOKING FOR AN <strong>FRONT DESK RECEPTIONIST</strong> BASED AT OUR NYC CORPORATE OFFICE (NOT REMOTE).</p><p><br></p><p>Started in 1975 in Spain, ZARA today is an internationally known fashion retailer represented in over 88 countries around the world. Our company requires professionalism, imagination, high energy and team spirit. ZARA will give you the means to excel. ZARA will put you into the heart of the action and the heart of its growth.</p><p><br></p><p><strong>FRONT DESK RECEPTIONIST</strong></p><p><strong><span class=\"ql-cursor\"> </span></strong></p><p>Position based in our NYC Corporate Office (NOT REMOTE)</p><p><br></p><p>We are seeking a highly organized and detail oriented Corporate Office Manager to oversee the daily operations of the cooperate office. The ideal candidate will be responsible for managing administrative tasks, coordinating office procedures, and ensuring the smooth functioning of the office environment. Office manager maintaining efficient communication channels, support staff members, and implement office procedures.</p><p><br></p><p><strong>Responsibilities:</strong></p><p><br></p><ul><li>Manage and supervise receptionist.</li><li>Oversee day-to day office operations including maintenance of office equipment, supplies and facilities.</li><li>Plan and coordinate in-house or off-site events and meetings.</li><li>Maintain the office condition and image, supervising services and arranging necessary repairs and extra cleaning services.</li><li>Assist with office layout planning and moves.</li><li>Work with building coordinator to coordinate visitors access, use of common spaces, and maintenance.</li><li>Handle incoming and outgoing correspondence.</li><li>Ensure all invoices related to office spending are billed and paid on time.</li><li>Keep updated records and files of office expenses and cost.</li><li>Coordinate domestic ground transportation reservations.</li><li>Work closely with travel agency to respond and resolve traveler’s request.</li><li>Maintain Travel platform (Concur) up to date and provide functional support to users on booking and expense system.</li></ul><p><br></p><p><strong>Personal profile:</strong></p><p><br></p><ul><li>Prior experience in similar role in a fast-paced environment is essential (min. 2 years).</li><li>Degree in business administration, hospitality management or related field.</li><li>Excellent written and verbal communication. English is essential (Spanish is a plus).</li><li>Ability to multitask and prioritize tasks in a fast-paced environment.</li><li>Good knowledge of Microsoft Suite (Outlook, Word, and Excel).</li><li>High level attention and accuracy in record-keeping.</li><li>Analytical skills to interpret data and generate insightful reports.</li><li>Positive attuite and professional demeanor.</li><li>Customer service oriented.</li></ul><p><br></p><p>Annual compensation range: $58,667 - $66,000 + discretionary annual bonus</p><p><br></p><p>* Zara, in good faith, believes that this posted rate of compensation is the accurate range for this role at this location at the time of this posting. This range may be modified in the future. Actual compensation within that range will be dependent upon the individual’s skills, experience, qualifications, and applicable laws.</p><p><br></p><p>Our company requires professionalism, imagination, high energy and team spirit. Sounds like you? THEN, APPLY NOW ONLINE TODAY!</p><p><br></p><p>Zara USA, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, gender, gender identity and expression, sex, sexual orientation, disability, age, citizenship status, veteran status or any other characteristic protected by applicable federal, state or local laws.</p><p><br></p><p><br></p><p>JOIN US NOW!</p><p><br></p><p><br></p><p>EOE/DFW</p>\n        </div>"},
{"title": "Warehouse Order Picker", "location": "Bolingbrook, IL", "level": "Entry level", "type": "Full-time", "function": "Management and Manufacturing", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Job Description<br><br></strong>First Shift Position, 6AM to 3PM with a 60-minute unpaid lunch, Mon-Fri<br><br>This position will primarily assist with picking orders for shipment plus a mix of packing and wrapping participation.<br><br><strong>Job Responsibilities include (but not limited to):<br><br></strong><ul><li>Prepares orders by processing requests and supply orders; pulling materials; packing boxes; placing orders in delivery area. </li><li>Assists in inventory counts by counting and making appropriate adjustments</li><li>Provides quality service by following organization standards. </li><li>Keep a clean and safe working environment and optimize space utilization</li><li>Communicate and cooperate with supervisors and coworkers</li><li>Follow quality service standards and comply with procedures, rules and regulations<br><br></li></ul><strong>Requirements<br><br></strong><ul><li>Proven working experience as a Warehouse Worker, preferably in a parcel, picker or inventory role</li><li>Previous forklift experience required preferred</li><li>Proficiency in inventory software, databases and systems</li><li>Good organizational and time management skills</li><li>High school degree</li><li>Ability to lift up to 50 pounds</li><li>Ability to maintain a high level of physicality for prolonged periods and working primarily standing</li><li>Experience working in a fast-paced environment while maintaining attention to detail</li><li>Interpersonal skills are essential, as working as a team is vital to maintaining an organized warehouse</li><li>Ability to problem solve quickly and prioritize daily tasks according to their importance</li><li>Customer service mentality is beneficial to ensure a positive customer experience by shipping items to a high standard<br><br></li></ul><strong>Company Description<br><br></strong>Windy City Wire has been leading the way in low-voltage wire innovations since 1994. As a company, we are dedicated to developing solutions that generate significant results for our customers. We don’t want to simply sell cable, we want to provide comprehensive cable management solutions that save integrators time on their projects from concept to completion.<br><br>Windy City Wire has been leading the way in low-voltage wire innovations since 1994. As a company, we are dedicated to developing solutions that generate significant results for our customers. We don’t want to simply sell cable, we want to provide comprehensive cable management solutions that save integrators time on their projects from concept to completion.\n        </div>"},
{"title": "Health Educator/Training + Design Specialist", "location": "Los Angeles, CA", "level": "Entry level", "type": "Full-time", "function": "Other", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Job Description<br><br></strong><strong>GENERAL DUTIES:<br><br></strong>The Training + Design Specialist will be responsible for developing and delivering sexual and reproductive health training (both in-person and virtual) and technical assistance to health care professionals and other key stakeholders across the country; organizing and facilitating webinars on sexual and reproductive health and justice topics; designing workshops; developing new curriculum, training tools, and e-learning content; and other special projects as assigned. The Training + Design Specialist will be a member of the capacity building division of the organization (The Learning Exchange). This position is based in the organization’s Los Angeles office with a hybrid remote/in-office work schedule. The salary range for this is position $80-85k<br><br><strong>SPECIFIC DUTIES + RESPONSIBILITIES:<br><br></strong><ul><li> Design, develop and deliver in-person and virtual trainings and workshops in the field of sexual and reproductive health (SRH) in both English and Spanish (preferred) for diverse internal and external audiences. </li><li> Provide support for implementation of capacity building efforts (training, webinars, technical assistance etc.) through developing agendas, coordinating with partners, scheduling trainings, managing registrations, maintaining training records etc. </li><li> Contribute to the design and production of training materials in English and Spanish (preferred) including participant manuals, visual aids, job aids, tool kits, videos and e-learning modules, etc. </li><li> Assist in the development, planning and launch and marketing of new Spanish-language trainings, webinars, and resources. Bilingual candidates to assist in the translation and facilitation of Spanish-language trainings and resources. </li><li> Support division-wide efforts in data collection, evaluation and project planning including review of course evaluation feedback and by implementing quality assurance reviews. </li><li> Support our annual Sexual Health Update Conference planning team with development of agenda and negotiations with speakers; write bios and workshop descriptions; coordinate and collect presenter materials, handouts and presentation; moderate conference sessions and panels. </li><li> Monitor project and contract scopes of work, timelines and budgets as assigned. </li><li> Collaborate with internal teams in the Programs + Strategic Initiatives Department to assist in the development of course content as well as training staff around best practices in public speaking and training facilitation skills. </li><li> Knowledgeable in the tenants of health literacy in order to convert complex medical information into accessible and understandable content for diverse audiences. </li><li> Responsible for staying up-to-date on evidence-based best practices in the field of SRH through conference and webinar attendance and regular review of journal articles and new and emerging data. </li><li> Evaluate, amend and revise division-wide materials with relevant clinical updates, evidence-based approaches and new best practices as needed and on an ongoing basis. </li><li> Assist with assessment of learner feedback and implementation of improvement plans to address learner needs. </li><li> Complete assigned reports as required. Support marketing of programs and other LE-related services. </li><li> Coordinate continuing education reporting for Certified Health Education Specialist (CHES) in conjunction with our agency Continuing Education Committee. </li><li> Additional duties, as assigned. <br><br></li></ul><strong>KNOWLEDGE, SKILLS, ABILITIES:<br><br></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required to perform this job.<br><br><ul><li> Fluent in English and Spanish (preferred). </li><li> Degree (Bachelor’s or Masters) in public health, health education, nursing, or related field; or equivalent years of experience. </li><li> 2-3 years’ experience in the field of sexual and reproductive health or related field. </li><li> 2-3 years’ experience developing course materials and delivering training for adult learners. </li><li>Proficient with Zoom platform (meetings, webinars, recordings, team chat, whiteboard, etc.)</li><li>Experience with course authoring tools (e.g., Camtasia, Storyline, Captivate) and learning management systems for developing and hosting interactive e-learning modules. </li><li>Proficiency with Microsoft (Excel, Word, Power Point) and Adobe Creative Cloud (InDesign, Photoshop, Acrobat) computer software. </li><li> Experience developing, implementing and evaluating training programs for adults. </li><li> Demonstrate independent decision making per scope of work. </li><li> Work with culturally and linguistically diverse groups. </li><li> Management of meeting logistics. </li><li> Ability to create positive working relationships. </li><li> Excellent written and verbal communication skills. </li><li> Ability to work independently and/or in a team setting. </li><li>Excellent organizational skills and adept at working on multiple projects. <br><br></li></ul><strong>CERTIFICATES, LICENSES, REGISTRATIONS:<br><br></strong>A current California Driver’s License, current registration and current automobile insurance coverage is required if you drive on company business. Certified Health Education Specialist (CHES) certified applicant preferred.<br><br><strong>Company Description<br><br></strong>About Essential Access Health<br><br>Mission: Essential Access Health champions and promotes quality sexual + reproductive health care for all<br><br>Essential Access Health (Essential Access) achieves its mission and advances health equity through a wide range of programs and services including clinic support initiatives, provider training, advanced clinical research, advocacy, and public awareness campaigns. Essential Access operates the Title X federal family planning program in California and Hawai'i and serves as the lead fiscal and program administrator for state-supported funding streams that support access to abortion and birth control for individuals with low-incomes seeking these essential services in California.<br><br>Commitment to Equity, Diversity, Justice + Inclusion<br><br>Essential Access was established in 1968, grounded in the belief that everyone has the right to access the health services and information they want – with dignity and respect. Although significant gains have been made in expanding access to essential health services over the past 50 years, true progress cannot be attained without confronting and addressing racism, advocating for equity and justice for all, including the LGBTQ+ community and individuals with disabilities. We are committed to integrating a health equity lens into our policies and broad range of programs and services and taking meaningful action to promote equitable and optimal sexual and reproductive health outcomes for all.<br><br>Join Us<br><br>With offices in Northern and Southern California, our dedicated staff are leading experts in the field of sexual and reproductive health – as researchers, trainers, health care leaders, and more.<br><br>About Essential Access Health Mission: Essential Access Health champions and promotes quality sexual + reproductive health care for all Essential Access Health (Essential Access) achieves its mission and advances health equity through a wide range of programs and services including clinic support initiatives, provider training, advanced clinical research, advocacy, and public awareness campaigns. Essential Access operates the Title X federal family planning program in California and Hawai'i and serves as the lead fiscal and program administrator for state-supported funding streams that support access to abortion and birth control for individuals with low-incomes seeking these essential services in California. Commitment to Equity, Diversity, Justice + Inclusion Essential Access was established in 1968, grounded in the belief that everyone has the right to access the health services and information they want – with dignity and respect. Although significant gains have been made in expanding access to essential health services over the past 50 years, true progress cannot be attained without confronting and addressing racism, advocating for equity and justice for all, including the LGBTQ+ community and individuals with disabilities. We are committed to integrating a health equity lens into our policies and broad range of programs and services and taking meaningful action to promote equitable and optimal sexual and reproductive health outcomes for all. Join Us With offices in Northern and Southern California, our dedicated staff are leading experts in the field of sexual and reproductive health – as researchers, trainers, health care leaders, and more.\n        </div>"},
{"title": "Human Resources (HR) Assistant", "location": "Los Angeles, CA", "level": "Entry level", "type": "Full-time", "function": "Human Resources", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Job Description<br><br></strong><strong>Job Title:</strong> <strong>HR Assistant<br><br></strong><strong>Shift: 1st Shift<br><br></strong><strong>Location: North Hollywood CA 91605<br><br></strong><strong>Job Summary: <br><br></strong><ul><li> The Human Resources Assistant will directly assist the Human Resources team with a wide variety of projects related to HR compliance, recruiting, onboarding/orientation, employee benefits and other HR tasks. </li><li> This position is designed to be both educational and practical while providing hands on exposure to business operations. </li><li> The areas of focus will be a wide scope of practical Human Resource practices<br><br></li></ul><strong>Job Duty:<br><br></strong>Coordinating pre-employment background and drug screens for new hires<br><br>Preparing materials for new hire orientation and on-boarding of new hires<br><br>Supporting special projects related to compliance, employee engagement and process improvements<br><br>Assist with recruiting, scheduling interviews<br><br>Filing<br><br>Facilitating and tracking mandatory trainings<br><br><strong>Company Description<br><br></strong>Intellyk is a Joint Commission Certified global staff augmentation firm providing a wide-range of talent on-demand and total workforce solutions. To know more about Intellyk, please visit our website www.intellyk.com.<br><br>We are constantly on the lookout for professionals to fulfil the staffing needs of our clients, and we currently have a job opening that may interest you.<br><br>Intellyk is a Joint Commission Certified global staff augmentation firm providing a wide-range of talent on-demand and total workforce solutions. To know more about Intellyk, please visit our website www.intellyk.com. We are constantly on the lookout for professionals to fulfil the staffing needs of our clients, and we currently have a job opening that may interest you.\n        </div>"},
{"title": "Coordinator, Digital Content", "location": "Cleveland, OH", "level": "Entry level", "type": "Full-time", "function": "Marketing, Public Relations, and Writing/Editing", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Cavaliers Holdings LLC is committed to delivering epic experiences for our fans, team members, community, and the world. Fueled by a diverse, equitable and inclusive culture, we strive to recruit individuals that will be enthusiastic and purposeful in carrying out our vision as Transformative Leaders in Sports and Entertainment. If you are ready to work in the fast-paced and high-energy setting of the Cavs, Monsters, Charge, Legion and Rocket Mortgage FieldHouse— then we want to talk to YOU!<br><br><strong>Position Summary<br><br></strong>The Cleveland Monsters and Rocket Entertainment Group Franchise Properties are looking for a talented <strong>Digital Content Coordinator</strong> and editor who can help drive engaging and impactful content through the Cleveland Monsters digital and social media channels and maintain a professional appearance to team digital communications. The ideal fit for this role is a creative content mind who is a self-starter, is organized, understands the online culture of the sport and keeps a close eye on the evolving trends of social media and video development. The ideal fit recognizes the important role digital content plays in support all areas of our business, and has aspirations to grow as a well-rounded marketer.<br><br>This position, based at Rocket Mortgage FieldHouse, will report to the Director of Communications &amp; Community Impact, Cleveland Monsters. This role will work closely with creative teams and counterparts in digital content, graphic design, FieldHouse Creative, and communications, as well as digital leads within the organization, on an on-going basis.<br><br>A main focus area for this position will be assisting with content creation as directed by team leads. Content may include social posts, webpages on clevelandmonsters.com, the Monsters Mobile App, graphics, video, e-mail communications, and game coverage. This person will work with existing brand guidelines to create content that fits the brand’s voice and aesthetic. This individual will be relied upon to contribute ideas and best practices relative to the digital space. This position will work with departmental leads to help populate and maintain a digital content calendar for the Cleveland Monsters. Another key focus of this position will be providing general support for the Monsters Communications team and lending similar support as directed for Cleveland Charge initiatives.<br><br>This person is required to be at all Cleveland Monsters home games at Rocket Mortgage FieldHouse and will be asked to help with select road game coverage remotely (no travel required). On game days, this position will support the needs of the Monsters PR &amp; Communications team.<br><br>The <strong>Digital Content Coordinator</strong> should be proficient with a number of creative applications that will be key to the role, including but not limited to Adobe Premiere, Adobe Photoshop, TikTok, Twitter, Facebook, and Instagram.<br><br>This is an <strong>entry-level role</strong> seeking minimum 6 months experience.<br><br><strong>Essential Duties &amp; Responsibilities<br><br></strong><ul><li>Consistently meets, works with, and develops strong relationships with team members across departments by being engaged and involved with team activities. Has finger on the pulse of these initiatives and executes through proactive thinking, creativity and innovation.</li><li>Possesses an overall positive attitude while managing multiple projects across different franchises and departments.</li><li>Helps to provide social media and PR coverage for roughly 50% of Monsters away games from home.</li><li>Actively seeks out new and innovative ways to engage with our fans in the digital space.</li><li>Provides new ideas of how to compliment or elevate team initiatives through digital activation.</li><li>Supports the efforts of our Ticket Sales and Corporate Partnerships teams by promoting key initiatives and activation of contractually obligated partnership elements. </li><li>Actively recaps and communicates the impact of the team’s digital activity, including regular reporting to team leaders.</li><li>Exhibit compelling storytelling through all content and platforms.</li><li>Captures, produces, and edits video and photo content for team social media and digital channels.</li><li>Ensure all content is on-brand, consistent in style, quality, and voice.</li><li>Contribute to digital, marketing, and creative brainstorming sessions.</li><li>Works with corporate partnerships team to plan, execute, and track contracted partnership activation in the digital space.</li><li>Maintains and builds library of high quality images for marketing &amp; social use<br><br><br></li></ul><strong>Required Qualifications<br><br></strong><ul><li> Bachelor’s degree in communications, marketing, social media or related field is required. </li><li>Minimum 1 year experience in Premiere, After Effects and Photoshop.</li><li>Must provide link to portfolio or relevant work for consideration.</li><li>Experience in managing social accounts for a brand, especially in sports, is a plus.</li><li>Strong creative thinking and ability to plan and propose new ideas.</li><li>Ability to act as on-camera talent at in-market events a plus.</li><li>Creative and strategic in nature with an understanding of how to turn access into content.</li><li>Desire to seize opportunities and take initiative without needing to be told.</li><li>Must be organized, highly motivated and team oriented.</li><li>Ability to thrive in a fast-paced, deadline-oriented workplace.</li><li>Maturity, professionalism, and a strong work ethic are essential.</li><li>Must be able to work non-traditional hours including evenings, weekends, and holidays on short notice as required.</li><li> Must provide link to portfolio or relevant work for consideration.<br><br><br></li></ul>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, age, disability, gender identity, marital or veteran status, or any other protected class.<br><br>Apply Now\n        </div>"},
{"title": "Virtual Booking Assistant-ENTRY LEVEL (Remote)", "location": "New York, United States", "level": "Entry level", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Join us as a Virtual Travel Booking Assistant, where your main task revolves around ensuring travelers have a seamless and memorable journey. Embrace remote work and utilize digital tools to assist clients with their travel arrangements.<br><br><strong>Responsibilities:<br><br></strong><ul><li>Client Engagement: Interact with clients via email, phone, or chat to grasp their travel requirements. Tailor personalized recommendations and itineraries to suit their preferences.</li><li>Research and Planning: Dive into extensive research on destinations, accommodations, transportation, and activities to craft bespoke travel plans. Stay informed about travel trends and restrictions.</li><li>Booking Services: Secure reservations for flights, hotels, rental cars, tours, and other travel services, always aligning with the client's preferences and budget.</li><li>Travel Documentation: Aid clients in obtaining essential travel documents, visas, and insurance. Offer guidance on passport and visa prerequisites.</li><li>Budget Oversight: Assist clients in managing their travel budgets by presenting cost-effective options and highlighting potential expenses.</li><li>Travel Itineraries: Develop detailed travel schedules encompassing daily activities, dining reservations, and client requests.</li><li>Problem Resolution: Tackle any travel-related issues or emergencies during the client's trip, such as flight disruptions or accommodation hiccups.</li><li>Customer Support: Deliver exceptional customer service, maintaining a positive demeanor and promptly addressing client queries.</li><li>Documentation Management: Keep meticulous records of bookings, client preferences, and communications for future reference and follow-up.<br><br></li></ul><strong>Requirements:<br><br></strong><ul><li>Superb communication and interpersonal skills.</li><li>Strong organizational and time-management prowess.</li><li>Passionate about travel with a solid understanding of various destinations.</li><li>Adaptability and effective problem-solving abilities.</li><li>Previous experience in travel or virtual assistance is advantageous but not obligatory.</li><li>Flexibility to accommodate different time zones or handle emergencies.</li><li>Reliable high-speed internet connection and a distraction-free workspace.<br><br></li></ul><strong>Perks:<br><br></strong><ul><li>Remote work flexibility promoting a healthy work-life balance.</li><li>Access to exclusive travel perks, discounts, and romantic offerings.</li><li>Opportunity to contribute significantly to creating unforgettable romantic experiences.</li><li>Continuous training and professional development opportunities to hone your skills.</li><li>Collaborative team environment fostering creativity and growth.</li><li>Competitive compensation package with performance-based incentives.<br><br></li></ul><strong>Benefits:<br><br></strong><ul><li>Flexible Schedule</li><li>Travel Perks</li><li>Licensed &amp; Bonded</li><li>Personal Website</li><li>E&amp;O Insurance with Fraud Protection</li><li>Daily Training Available</li><li>Travel Agent Certification</li><li>Remote Business Opportunity</li><li>Full Training Provided</li><li>Work FT or PT</li><li>No experience necessary<br><br></li></ul>Powered by JazzHR<br><br>Yihsd4x20n\n        </div>"},
{"title": "Virtual Research & Scheduling Assistant-Entry Level", "location": "Lexington, KY", "level": "Entry level", "type": "Part-time", "function": "Management and Manufacturing", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          A love of travel attracts many people to the field, but to succeed, a Research &amp; Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research &amp; Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.<br><br>Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.<br><br>We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!<br><br><strong>️Job Description:<br><br></strong><ul><li>Arrange Cruise Travel for vacations, honeymoons, weddings and more</li><li>Determine customer's needs and preferences, such as schedules, costs and payment plans</li><li>Plan and arrange tour packages, excursions, and day trips</li><li>Book reservations for travel, hotel, flights, rental cars, special events, honeymoons<br><br></li></ul><strong>Benefits:<br><br></strong><ul><li>Full Training Provided</li><li>Work PT or FT</li><li>No experience necessary</li><li>Travel Perks</li><li>Licensed &amp; Bonded</li><li>Personal Website</li><li>Daily Training Available</li><li>Certification provided</li><li>Remote Business Opportunity <br><br></li></ul><strong>️Requirements:<br><br></strong><ul><li>Must be 18+</li><li>Computer with good WiFi</li><li>Self Motivated</li><li>Detail Oriented</li><li>Customer Service Skills is a plus<br><br></li></ul>This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today. 1099 Business Opportunity<br><br>Join Our Team NOW to Unlock Your Freedom and start your Entrepreneurial Journey in the Travel Industry<br><br>Powered by JazzHR<br><br>cLYsTUWZia\n        </div>"},
{"title": "Junior Virtual Assistant", "location": "Philadelphia, PA", "level": "Entry level", "type": "Full-time", "function": "Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          This is a remote position.<br><br><strong> <strong>Junior Virtual Assistant</strong> (1 year experience, remote)<br><br></strong>Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.<br><br><strong> Hiring Type:</strong> Full-Time<br><br><strong> Base Salary:</strong> $59K-$69K Per Annum.<br><br>Responsibilities:<br><br><ul><li>Executive Assistant Support </li><li>Regular client interfacing (via phone/video conference) </li><li>Email management (checking/organizing one or more inboxes for each client) </li><li>Calendar management (coordinate internal and external meetings for multiple executives, manage hectic and complex calendars) </li><li>Preparing materials such as presentations, expense reports, spreadsheets, documents, etc. </li><li>Travel management (researching itineraries, making reservations, booking international and national flights, etc.) </li><li>Assist with the development of communications and content (e.g. webinars, newsletters, emails, website content) </li><li>Research tasks </li><li>Support implementing digital marketing plans (i.e. scheduling newsletters or social media posts, etc) </li><li>Operations Support - creating/executing/maintaining standard operating procedures, workflows, and processes </li><li>Admin tasks associated with CRM software <br><br></li></ul>Key Attributes<br><br><ul><li>Confident, decisive, and experienced communicator with strong written and verbal skills that can use tact and diplomacy when interfacing with different personalities </li><li>Professional and friendly demeanor </li><li>Detail-oriented and able to work efficiently with minimal errors </li><li>Proactive and willing to suggest additional areas of responsibility that can be delegated </li><li>Independently seek to identify and resolve problems by being a creative and proactive problem-solver - be solutions-focused </li><li>Ability to work in a fast-paced virtual environment, manage priorities/deadlines accordingly </li><li>Tech-savvy, eager, and quick to learn new technology </li><li>Capable of performing duties with a high level of confidentiality and discretion while exhibiting integrity and trustworthiness with sensitive information </li><li>Cope well with ambiguity and changes in direction as solutions are developed </li><li>Ambitious, engaging, positive self-starter, flexible, patient, and open-minded with a great attitude <br><br></li></ul><strong>Qualifications<br><br></strong><ul><li>Previous experience managing multiple clients, accounts, and projects required </li><li>2+ years of providing complex calendar management and email management required </li><li>Experience with creating travel arrangements and compiling expense reports </li><li>Available to complete work, communicate via email, have Zoom meetings etc. </li><li>Mac (preferred) or Personal Computer (including webcam) with the most recent version of MS Office installed (all programs; PowerPoint, Word, Excel, and Outlook) </li><li>A fast and reliable internet connection </li><li>Smartphone with email capabilities and the ability to download various apps </li><li>Preference to candidates proficient in common online programs/software used by small business owners. </li><li>Technology confidant- - including but not limited to Microsoft Office, Google Suite, and common CRM and Project Management platforms <br><br></li></ul>Bachelor’s degree preferred<br><br>\n        </div>"},
{"title": "Junior React Developer", "location": "Charlotte, NC", "level": "Entry level", "type": "Full-time", "function": "Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong><strong>Junior React Developer</strong> (1 year experience, hybrid)<br><br></strong>Be part of our future! This job posting builds our talent pool for potential future openings. Well compare your skills and experience against both current and future needs. If theres a match, well contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.<br><br><strong> Hiring Type:</strong> Full-Time<br><br><strong> Base Salary:</strong> $57K-$67K Per Annum.<br><br>Responsibilities:<br><br><ul><li>Develop and implement high-quality, scalable, and maintainable React components for our web applications. </li><li>Collaborate with the development team to translate design mock-ups into functional features. </li><li>Participate in code reviews and provide constructive feedback to enhance the overall code quality. </li><li>Debug and resolve software defects and issues. </li><li>Stay updated with the latest industry trends and best practices in front-end development. <br><br></li></ul>Requirements:<br><br><ul><li>Proficiency in HTML, CSS, and JavaScript. </li><li>Strong understanding of React and its ecosystem. </li><li>Experience working with RESTful APIs and integrating backend services. </li><li>Familiarity with version control systems (e.g., Git). </li><li>Good problem-solving and analytical skills. </li><li>Excellent communication and collaboration abilities. </li><li>Ability to learn quickly and adapt to new technologies and frameworks.</li></ul>\n        </div>"},
{"title": "M&A Development Director", "location": "Houston, TX", "level": "Executive", "type": "Full-time", "function": "Business Development and Sales", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>M&amp;A Development Director<br><br>São Paulo, Brazil<br><br></strong>Our client is a multinational company specialized in the corporate service industry, operating worldwide. Based on innovation, ambition, and integrity, it’s an expanding company active in more than 120 countries with over 70,000 FTE´s globally.<br><br>Due to their expansion, they are now looking for an M&amp;A Development Director (job creation) who will be responsible for identifying and evaluating potential M&amp;A targets that align with North America's strategic goals. Key responsibilities involve market screenings, strategic and financial analysis, negotiations, pre-selection processes, stakeholder management, discussion facilitation, internal collaboration, and senior management reporting.<br><br>Key Responsibilities:<br><br><ul><li>Conduct comprehensive market screenings to identify potential M&amp;A targets in accordance with company objectives and growth strategies.</li><li>Lead the pre-selection process of potential targets through strategic fit analysis, considering factors such as market positioning, product portfolio, geographic presence, and synergies.</li><li>Perform initial financial profile analysis of potential targets, including financial statements, valuation metrics, and potential risks.</li><li>Initiate one-to-one negotiations with pre-selected targets, demonstrating a clear understanding of their business operations, objectives, and value propositions.</li><li>Develop and maintain relationships with key stakeholders at target companies, including executives, owners, and advisors.</li><li>Develop and maintain relationships with key industry associations and groups to promote continuous identification of potential M&amp;A targets</li><li>Facilitate discussions and negotiations regarding potential acquisitions, addressing concerns, and identifying areas of alignment.</li><li>Collaborate with internal teams, including legal, finance, and strategy, to assess the feasibility and implications of potential acquisitions.</li><li>Prepare and present comprehensive reports and recommendations to senior management regarding potential M&amp;A opportunities.</li><li>Monitor industry trends, competitor activities, and market dynamics to identify emerging opportunities and potential threats.</li><li>Ensure compliance with regulatory requirements and internal policies throughout the M&amp;A process.</li><li>Manage the one-to-one M&amp;A pipeline for North America<br><br></li></ul>Qualifications:<br><br><ul><li>Bachelor’s degree in business administration, Finance, Economics, or a related field; MBA or equivalent preferred.</li><li>Strong understanding of financial analysis, including valuation methodologies, financial modelling, and due diligence processes.</li><li>Strategic thinker with the ability to analyze complex situations, identify opportunities, and develop innovative solutions.</li><li>High level of professionalism, integrity, and discretion when dealing with sensitive information.<br><br></li></ul>This is really a great opportunity for a driven professional that wants to be part of an ambitious organization and highly motivated team, with lots of opportunities for personal and professional growth.<br><br>Location: Houston, Texas.<br><br>Powered by JazzHR<br><br>DXjP84O8zM\n        </div>"},
{"title": "Scrum Master", "location": "Orlando, FL", "level": "Mid-Senior level", "type": "Contract", "function": "Engineering and Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Job Description<br><br></strong>BlueWave is hiring a Scrum Master for a leading enterprise company with headquarters in Orlando, FL 34747. As a Scrum Master, you will coach and guide teams to deliver strategic Data Products enabling an environment and team culture of trust, empathy, agility, and high standards.You will use your knowledge of people skills, agile methodology, &amp; frameworks, coaching, partnering, and influencing to ensure that data products are delivered in a timely, productive, &amp; collaborative manner and be accountable for agile maturity through the measurement of crucial team performance indicators.<br><br><strong>Responsibilities:<br><br></strong><ul><li>Manage each project’s scope and timeline</li><li>Possessing expert-level knowledge of agile practices; Coach team members to be successful using the appropriate frameworks and principles for the job</li><li>Facilitate internal communication and effective collaboration</li><li>Work in tandem with product ownership and management on product direction, backlogs, new requests, and reporting out on key metrics such as burnups, burndowns, velocity, and capacity</li><li>Resolve conflicts and remove obstacles that occur with a high level of urgency</li><li>Help teams implement changes effectively</li><li>Ensure deliverables are up to quality standards at the end of each sprint</li><li>Guide development teams to higher scrum maturity</li><li>Lead vital ceremonies such as sprint planning, reviews, retrospectives, stand-ups, etc. </li><li>Help build a productive environment where team members ‘own’ the product and enjoy working on it. <br><br></li></ul><strong>Requirements: <br><br></strong><ul><li>Possess high levels of ownership, adaptability, and attention to detail</li><li>Highly experienced in all areas of the Product Process, Agile principles and frameworks, and servant leadership</li><li>Demonstrated success in leading high-performing scrum teams</li><li>Ability to balance multiple competing priorities while maximizing value</li><li>Highly experienced across a wide array of SDLC practices such as agile, waterfall, and corresponding frameworks</li><li>Knowledge and experience with data, data science, analytics, and business intelligence</li><li>Highly experienced in project management practices, methodologies, and frameworks</li><li>Genuine empathy for the customer, the scrum team, and the partners</li><li>Proven ability to influence cross-functional teams without formal authority</li><li>Strong oral and written communication and interpersonal skills, including story-telling, relationship-building, influence, and negotiation &amp; Proven track record of agile coaching and mentoring<br><br></li></ul><strong>Employment Type: </strong>Full-Time Hybrid in Orlando, FL 34747<br><br><strong>Benefits: </strong>Competitive Salary, Health Insurance, and Ancillary Benefits<br><br>BlueWave specializes in recruiting high-performing team members for technology, marketing, federal services, and leadership roles. We’re aggressive hunters – but only of talented people – &amp; provide comprehensive staffing support for recruiting, hiring, and onboarding permanent and contract employees.<br><br>BlueWave is headquartered in Downtown Orlando, Florida with the flexibility to build teams nationally. With our boutique and personal approach, we get the right people in your company quickly without sacrificing quality.<br><br>https://bluewaverp.com/<br><br><strong>Company Description<br><br></strong>BlueWave specializes in recruiting high-performing team members for technology, digital marketing, and engineering teams. While providing exceptional service and quality, we create a talent acquisition roadmap to support long-term and sustainable growth for companies looking to scale.<br><br>BlueWave specializes in recruiting high-performing team members for technology, digital marketing, and engineering teams. While providing exceptional service and quality, we create a talent acquisition roadmap to support long-term and sustainable growth for companies looking to scale.\n        </div>"},
{"title": "Administrative Assistant", "location": "Jacksonville, FL", "level": "Entry level", "type": "Full-time", "function": "Administrative", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Nemas International is looking for an administrative assistant to join our team remotely. This person will work to support the daily operations of the office.<br><br>The ideal candidate is a high-energy individual with excellent organizational skills, a strong attention to detail and the ability to communicate effectively in both written and verbal communications.<br><br>Responsibilities:<br><br><ul><li>Field inbound communications - Answer phone calls/general email inquiries and route to the appropriate internal parties as needed.</li><li>Coordinate scheduling - Set up meetings based on cross-functional availability for both internal and external stakeholders.</li><li>Organize internal resources - Build out and maintain processes to keep files and office supplies organized and easily accessible.</li><li>Liaise with visitors - Act as point person for office guests.</li><li>Communicate policies and procedures - Alert employees of new processes, rules and regulations.</li><li>Facilitate executive-level operations - Book travel, submit expense reports and send communications for high-level staff as needed.<br><br></li></ul>Requirements:<br><br><ul><li>High school diploma or equivalent.</li><li>1-2 years experience as an administrative assistant, secretary or receptionist preferred</li><li>Strong organizational, communication, and time-management skills</li><li>Proven ability to work in a fast-paced environment </li><li>Positive, high-energy attitude</li><li>Resourcefulness, creativity, and problem-solving skill set</li><li>Familiarity with office equipment (i.e. printers, fax machines, projectors)</li><li>Proficiency in Microsoft Office (especially MS Excel and PowerPoint)<br><br></li></ul>About Nemas International:<br><br>Nemas International is a full service provider of consumer product management, warranty and support for original equipment manufacturers and branded products throughout the Americas.<br><br>Our employees enjoy a work culture that promotes equality and diversity.<br><br>Nemas International benefits include health care, paid time off, retirement savings, employee assistance programs and professional development.<br><br>Employees can also take advantage of offerings like casual dress code, 401k, corporate discounts, and gym memberships etc.<br><br>Powered by JazzHR<br><br>mdlS83xlxf\n        </div>"},
{"title": "Director of Creative Ops", "location": "United States", "level": "Director", "type": "Full-time", "function": "Art/Creative, Design, and Management", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>Company Profile:</p><p>At CAVA we make it deliciously simple to eat well and feel good every day. We are guided by a Mediterranean heritage that’s been perfecting how to eat and live for four thousand years. We prioritize authenticity, curiosity and the pursuit of excellence in everything we do. We are working towards something big, together.</p><p><br></p><p>We foster a culture built on five core values:</p><ul><li>Generosity First, Always: We lead with kindness. Our best work happens when we act in service of others.</li><li>Constant Curiosity: We are eager to learn, grow, and explore beyond the obvious.</li><li>Act with Agility: We welcome change; it’s the only constant. We embrace, adjust, adapt.</li><li>Passion for Positivity: We greet each day with warmth and possibility.</li><li>Collective Ambition: We have high aspirations that are achieved when we work together with a shared purpose.</li></ul><p><br></p><p><br></p><p><strong>Director of Creative Operations</strong></p><p><br></p><p>CAVA is looking for a Director of Creative Operations to lead our end-to-end in-house creative team operations — from briefing through execution and implementation — including but not limited to project management, budgeting, resourcing, and system management in efforts to ensure efficiency, help with prioritization, and set up team to develop best in class creative work.</p><p>A Creative Operations Manager is the glue that holds the Creative team together and is the constant source of truth for the projects they manage. They need to be the ultimate team player: dedicated, hard-working, and able to maintain and share their positive attitude. They ensure that projects run smoothly and are delivered on time and on brief, while making sure all team members have the support and information they need. The ideal candidate approaches each task, small or large, with the same attention to detail and follow through. They thrive off creating systems and optimizing processes, all to drive clarity and efficiency, not only on their direct team but with cross functional teams as well.</p><p><br></p><p>As a seasoned professional in creative operations, you will play a key role in driving the success of our brand creative, ensuring efficiency, quality, and creative excellence throughout.</p><p><br></p><p><strong>What You’ll Do</strong></p><p><br></p><ul><li>Partner closely with Creative, Cross-Functional, and Executive Leadership to drive creative and brand alignment and decision making</li><li>Introduce operating models and practices that help our team achieve exceptional outcomes, quickly</li><li>Lead strategic design initiatives in partnership with design leadership peers</li><li>Lead the day-to-day operations of the Creative Operations team, driving an evolution where the team can improve</li><li>Oversee the execution of brand and marketing campaigns across design, copy, photo and video production, and content.</li><li>Facilitate collaborations between Creative, Brand, Digital, and the larger Experience Team, as well as cross-functional partners and departments</li><li>Build an atmosphere of collaboration. Build bridges between people and teams. Lean into and resolve conflicts when needed</li><li>Collaborate with the team to drive prioritization and staffing decisions</li><li>Mentor and guide your individual team members on our most complex projects, and help them achieve their individual growth goals</li><li>Own relationships with third-party agencies and freelancers, and facilitate these collaborations</li><li>Own our budget and partner with creative leadership for annual budget planning</li><li>Own and drive communications to keep the team informed and motivated</li></ul><p><br></p><p><strong>Core Functions</strong></p><p><br></p><ul><li><strong>Operational Strategy Development:</strong> Develop and implement operational strategies that support product creative and marketing objectives, ensuring alignment with overall business goals.</li><li><strong>End-To-End Process Management:</strong> Manage, coordinate, and optimize the briefing process by acting as a helpful conduit between brief writers and the creative team</li><li><strong>Cross-Functional Collaboration:</strong> Foster strong collaboration and communication across cross-functional teams, including creative, marketing, production, and project management, to ensure seamless workflows and creative excellence.</li><li><strong>Resource Allocation</strong>: Manage resource allocation and capacity planning, including the assignment of creative teams and resources to projects, to optimize productivity and meet project deadlines.</li><li><strong>Process Optimization:</strong> Continuously evaluate and refine creative processes, workflows, and tools to enhance operational efficiency, quality, and innovation.</li><li><strong>Budget Management:</strong> Oversee budgets for creative projects, ensuring responsible allocation of financial resources and adherence to financial goals.</li><li><strong>Performance Metrics:</strong> Establish and track key performance indicators (KPIs) to measure the effectiveness of creative operations, and use data-driven insights to drive improvements.</li><li><strong>Vendor and Partner Management:</strong> Collaborate with external vendors and partners as necessary, negotiating contracts, managing relationships, and ensuring high-quality deliverables.</li><li><strong>Team Leadership:</strong> Provide leadership and guidance to a team of creative operations professionals, fostering a culture of creativity, accountability, and continuous improvement.</li><li><strong>Compliance and Quality Assurance:</strong> Ensure compliance with industry standards, legal requirements, and quality assurance protocols in all creative operations.</li><li><strong>Risk Management:</strong> Identify potential risks and develop mitigation strategies to safeguard project timelines and creative deliverables.</li><li><strong>Technology Integration:</strong> Explore and implement innovative technologies and tools to enhance creative operations, productivity, and collaboration.</li></ul><p><br></p><p><strong>About You </strong></p><p><br></p><ul><li>7+ years of experience in creative operations, project management, or a related role.</li><li>4+ years of people management experience</li><li>Strong leadership and team management skills, with the ability to motivate and develop a high-performing team.</li><li>Exceptional strategic thinking and problem-solving abilities.</li><li>Proficiency in project management software and creative collaboration tools.</li><li>Excellent communication and interpersonal skills, with the ability to build strong working relationships across diverse teams.</li><li>Budget management experience and financial acumen.</li><li>Analytical mindset with the ability to interpret data and make data-driven decisions.</li><li>Knowledge of industry best practices and emerging trends in creative operations.</li><li>Strong organizational skills and the ability to prioritize and manage multiple projects simultaneously.</li><li>A bias for action. You operate with a distinct sense of drive, and you help your team do the same.</li><li>Sweat the details. You understand the details can make or break a project.</li><li>Skilled facilitator. You’re able to operate at all altitudes within an organization—from driving team workshops to executive reviews.</li><li>An optimist. You see the positive in situations, and encourage others to see it too.</li><li>Mentor for your team. Your team learns, grows, and becomes better versions of themselves by working with you.</li></ul><p><br></p><p><strong>Physical Requirements:</strong></p><p><br></p><ul><li>Ability to maintain stationary position to be able to operate a computer and other office equipment</li><li>Must be able to identify, analyze and assess details</li><li>For certain positions, must be able to occasionally move or transport items up to 50 pounds</li><li>Ability to communicate with others and exchange information accurately and effectively</li><li>Constantly positions self and move about to support ordinary restaurant or food production support or office operations, as applicable</li><li>Ability to work in a constant state of alertness and in a safe manner</li><li>What we offer:</li><li>Competitive salary, plus bonus and long-term incentives*</li><li>Unlimited PTO, paid parental leave, plus paid opportunities to give back to the community</li><li>Health, Dental, Vision, Telemedicine, Pet Insurance plus more!</li><li>401k enrollment with CAVA contribution</li><li>Company-paid STD, LTD, Life and AD&amp;D coverage for salaried positions*</li><li>Free CAVA food</li><li>Casual work environment</li><li>The opportunity to be on the ground floor of a rapidly growing brand</li></ul><p>*Indicates qualifying eligible positions only, and conditions may apply</p><p><br></p><p><br></p><p>CAVA – Joining “A culture, not a concept”</p><p><br></p><p><br></p><p>As an equal opportunity employer, CAVA considers applicants for all positions without regard to race, color, sex, religion, national origin, disability, age, height, weight, marital status, sexual orientation, familial status, genetic</p>\n        </div>"},
{"title": "Content Creator / Social Media Manager", "location": "New York, NY", "level": "Entry level", "type": "Full-time", "function": "Marketing, Public Relations, and Writing/Editing", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          We’re looking for a creative, driven individual with a photographic eye, knack for strong storytelling and an ability to understand &amp; connect with our customers at a high-level. This individual will be responsible for planning &amp; executing highly engaging content across all MAHI GOLD and MAHI GOLD Outfitters social, email and web platforms.<br><br>You will oversee our growing social media presence, continue to develop and foster our online community and deliver engaging digital experiences. You will lead planning, content creation, execution, and monitoring of our social strategy in order to drive new customer acquisition, retention, and sales. Essential to the position is the ability to create engaging, meaningful content, grow digital audiences, execute on strategies and analyze data to determine which initiatives work best to continue scaling, all while maintaining brand integrity and consistency.<br><br>Key ResponsibilitiesDevelop and execute best-in-class social strategy and programs in alignment with our company vision, brand story and a shared goal to increase reach and engagementBuild and implement social media strategy across channels (Instagram, Facebook, Pinterest, LTK and TikTok).Drive production of photo and video content for key storytelling initiatives, including strategizing, ideating, writing briefs, and overall project managementOwn the content calendar for MAHI GOLD and MAHI GOLD Outfitters. Work with the owners, buyers, e-commerce team and external creative agency to develop authentic, creative, on trend and consumer driven contentOwn the day-to-day management of social media as a key stakeholder for social media process, including meetings and recapsDevelop and execute Influencer strategy and relationship managementCreate actionable plans to grow engagement and followersSupport marketing initiatives by developing social media plans for key moments including brand campaigns, key product launches, and collaborationsMonitor the landscape and advocate for social and digital trends internally, influencing the brand and business strategiesBe the point of contact for reps for social platforms, own relationships and stay on top of best practices and new featuresPartner closely with paid marketing and analytics teams to drive social platform opportunitiesUtilize native social analytics and third-party toolsets to educate and advise on better content developmentLead ideation relative to social media strategies and content executions, pushing MAHI GOLD to be a leader in the rapidly evolving social media space<br><br>Experience/RequirementsExtensive understanding of current social platform best practices and proven experience executing campaigns across Facebook, Instagram, LTK and TikTokA keen, photographic eye with experience capturing &amp; editing photo and video content.A creative, “out-of-the-box” thinkerA desire to constantly follow social media trends and a clear POV on how brands can win in those moments.Self-starter. A go-getter who can dive in, be an owner, and influence cross-functional partners.Motivated by the social media industry, interest in staying on top of platform developments and new features.Ability to manage various projects &amp; campaigns across multiple business channels, often in different stages of planning and executionStrong and productive communication skills - both written &amp; verbalEntrepreneurial attitude and can-do mentalityExcellent communication skills, with the ability to engage diverse audiencesCapacity to adapt quicklyWillingness to travel, especially to different retail locations throughout the yearGraphic design experience &amp; ability to use platforms like Photoshop, Lightroom &amp; IllustratorBonus: Experienced use in Klayvio, LTK, Shopify &amp; TripleWhale Platforms\n        </div>"},
{"title": "Legal Assistant", "location": "Sugar Land, TX", "level": "Entry level", "type": "Full-time", "function": "Legal", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Job Description<br><br></strong>This is a full-time on-site role for a Legal Assistant located in Sugar Land. The Legal Assistant will be responsible for daily administrative tasks, such as answering phone calls, managing calendars, and organizing files. They will also be responsible for preparing legal documents, conducting legal research, and assisting with client communication.<br><br><strong>Qualifications<br><br></strong><ul><li>Strong understanding of law and legal processes</li><li>Experience in legal document preparation</li><li>Excellent communication skills, both verbal and written</li><li>Experience in administrative assistance</li><li>Experience as a Legal Assistant or similar role</li><li>Ability to work independently and cooperate with a team</li><li>Proficient in Microsoft Office Suite and legal research databases</li></ul>\n        </div>"},
{"title": "Crisis Intervention Specialist (Part-Time)", "location": "Iowa City-Cedar Rapids Area", "level": "Entry level", "type": "Part-time", "function": "Health Care Provider", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Position Summary<br><br></strong><strong>Area of Interest</strong> Behavioral Health – Non-Nursing;<br><br><strong>FTE/Hours per pay period</strong> 0.6;<br><br><strong>Department</strong> Crisis Services - GuideLink;<br><br><strong>Shift</strong> 1st/2nd shifts, rotating weekends, 24 hours per week;<br><br><strong>AbbeHealth Services</strong> - is a regional nonprofit organization dedicated to providing mental health and aging services that help individuals achieve their optimum levels of independence and success.<br><br>Crisis Services are designed to assist individuals who are in a mental health crisis and need a supportive environment and staff to help them work through the crisis. We provide a stable and consistent environment to adults who are experiencing a mental health crisis in a community setting 24 hours per day 7 days per week.<br><br><strong>Why UnityPoint Health?<br><br></strong><ul><li>Culture – At UnityPoint Health, you matter. Come for a fulfilling career and experience aculture guided by uncompromising values and unwavering belief in doing what's right for the people we serve.</li><li>Benefits –Our competitive Total Rewards program offers benefits options like 401K match, paid time off and education assistance that align with your needs and priorities, no matter what life stage you’re in.</li><li>Diversity, Equity and Inclusion Commitment– We’re committed to ensuring you have a voice that is heard regardless of role, race, gender, religion, or sexual orientation.</li><li>Development– We believe equipping you with support and development opportunities is an essential part of delivering a remarkable employment experience.</li><li>Community Involvement – Be an essential part of our core purpose—to improve the health of the people and communities we serve.<br><br><br></li></ul>Hear more from our team members about why UnityPoint Health is a great place to work at <strong>https//dayinthelife.unitypoint.org</strong>.<br><br><strong>Essential Duties And Responsibilities<br><br></strong><ul><li>Is aware of department compliance requirements for federally funded healthcare programs (eg. Medicare and Medicaid) regarding fraud, waste and abuse. Brings any questions or concerns regarding compliance to the immediate attention of department or administrative staff.</li><li>Purposefully conducts all aspects of the job in an ethical manner in support of the organization’s commitment to ethical behavior in all areas of personal and professional activity.</li><li>Demonstrates a positive cooperative attitude, flexibility, and a willingness to change to meet department goals.</li><li>Collaborate with the individual in crisis to develop and implement a crisis stabilization plan. This plan will assist the individual developing and implementing strategies which will help them to manage the impact of the crisis as they return home. </li><li>Create a supportive environment that includes admission process to the program, assessing status and immediate needs in collaboration with the mental health team. </li><li>Skill development interventions with the individual and documenting observable behaviors and symptoms. </li><li>Performs additional duties as may be assigned to ensure complete service to all customers.<br><br><br></li></ul><strong>PERSONAL SPECIFICATIONS<br><br></strong><strong>Education<br><br></strong>Bachelor’s degree in social work, nursing, psychology or other human services related is preferred. Highschool diploma or 2- year Associates degree will be considered.<br><br><strong>Qualifications/Experience<br><br></strong>Two years of relatable work experience in mental health and other human service-related positions. Iowa Driver’s License required.<br><br><strong>$10,000 Sign-on Incentive For Qualified Applicants!<br><br></strong>As a member of the interdisciplinary team, contributes professional nursing knowledge and skills in the provision and management of care to patients and their families. Maintains a practice environment that reflects the ANA Code for Nurses, Philosophy of Nursing at UnityPoint Health with in the structure of the Professional Nurse Practice Model and in collaboration with other care givers.<br><br><strong>Why UnityPoint Health?<br><br></strong><ul><li>Culture – At UnityPoint Health, you matter. Come for a fulfilling career and experience a culture guided by uncompromising values and unwavering belief in doing what's right for the people we serve.</li><li>Benefits – Our competitive Total Rewards program offers benefits options like 401K match, paid time off and education assistance that align with your needs and priorities, no matter what life stage you’re in.</li><li>Diversity, Equity and Inclusion Commitment – We’re committed to ensuring you have a voice that is heard regardless of role, race, gender, religion, or sexual orientation.</li><li>Development – We believe equipping you with support and development opportunities is an essential part of delivering a remarkable employment experience.</li><li>Community Involvement – Be an essential part of our core purpose—to improve the health of the people and communities we serve.<br><br><br></li></ul>Hear more from our team members about why UnityPoint Health is a great place to work at https//dayinthelife.unitypoint.org.<br><br><strong>Clinical Excellence/Patient Care<br><br></strong><ul><li> Assesses the needs of patients and families, providing appropriate teaching and making the necessary referrals to provide continuity of care.</li><li> Develops an individual plan of care using a collaborative approach with the patient/family and health care team.</li><li> Promptly completes documentation to assure an accurate legal record of patient’s care.</li><li> Delivers high quality care utilizing the nursing process while demonstrating knowledge and clinical skills of the specialty required on assigned unit in accordance with established policies, procedures and standards of care.</li><li> Utilizes holistic approach (considering biopsychosocial, spiritual, educational, safety, and related criteria) appropriate to the age of the patients and families served in the assigned service area.</li><li> Delegates and provides direction for other healthcare providers and hold them accountable for their involvement in the plan of care.</li><li> Utilizes critical thinking in making independent judgments, and maintains responsibility and accountability for the knowledge of conditions of assigned patients.</li><li> Utilizes nursing skills to complete collection of health information to complete admission assessment to ensure patient is ready for procedure. Identifying high risks and communicating to provider.</li><li> Delivers high quality care during procedure and where sedation may be provided. Using critical thinking skills to ensure patients remain in a safe environment.</li><li> Assesses and care for post-procedure patient. Identifying patient needs post- procedure to ensure readiness for discharge.</li><li> Partners with patients after discharge via follow-up phone call to identify any future patient needs.<br><br><br></li></ul>80%<br><br><strong>Development &amp; Patient Education<br><br></strong><ul><li> Continues professional development and involvement in professional activities that enhance nursing practice by sharing knowledge through networking and research.</li><li> Assess and chooses teaching strategies appropriate to the patient’s and their families’ age specific needs, culture, gender, readiness to learn and level of comprehension.</li><li> Consults appropriate resources within the hospital to provide specialized education.</li><li> Demonstrates knowledge that patient and workplace safety is a priority by preventing errors, accidents and infections and reporting potential or actual concerns immediately.<br><br><br></li></ul>20%<br><br><strong>Basic UPH Performance Criteria <br><br></strong><ul><li> Demonstrates the UnityPoint Health Values and Standards of Behaviors as well as adheres to policies and procedures and safety guidelines.</li><li> Demonstrates ability to meet business needs of department with regular, reliable attendance.</li><li> Employee maintains current licenses and/or certifications required for the position.</li><li> Practices and reflects knowledge of HIPAA, JCAHO, DNV, OSHA and other federal/state regulatory agencies guiding healthcare.</li><li> Completes all annual education and competency requirements within the calendar year.</li><li> Is knowledgeable of hospital and department compliance requirements for federally funded healthcare programs (e.g. Medicare and Medicaid) regarding fraud, waste and abuse. Brings any questions or concerns regarding compliance to the immediate attention of hospital administrative staff. Takes appropriate action on concerns reported by department staff related to compliance.<br><br><br></li></ul>10%<br><br><strong><em>Disclaimer</em></strong><em> This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that required of the employee. Other duties, responsibilities and activities may change or be assigned at any time with or without notice.<br><br></em><strong>Minimum Requirements<br><br></strong>Identify items that are minimally required to perform the essential functions of this position.<br><br><strong>Preferred Or Specialized<br><br></strong>Not required to perform the essential functions of the position.<br><br><strong>Education<br><br></strong>Graduate of accredited nursing program<br><br>BSN degree<br><br><strong>Experience<br><br></strong>Prefer one (1) year of hospital clinical experience or demonstrated clinical efficiency.<br><br><strong>License(s)/Certification(s)<br><br></strong>Current licensure in good standing to practice as a Registered Nurse in [type in State].<br><br>Must possess and maintain current Basic Life Support (BLS) certification or obtain certification within three (3) months from date of hire.<br><br>CORE Certification within six (6) months from date of hire.<br><br>PALS and ACLS Certification are optional<br><br>Valid driver’s license when driving any vehicle for work-related reasons.<br><br><strong>Knowledge/Skills/Abilities<br><br></strong>Writes, reads, comprehends and speaks fluent English.<br><br>Multicultural sensitivity.<br><br>Microsoft Office – basic computer skills.<br><br>Customer/patient focused.<br><br>Critical thinking skills using independent judgment in making decisions.<br><br><strong>Other<br><br></strong>Use of usual and customary equipment used to perform essential functions of the position.<br><br>Work may occasionally require travel to other UPH facilities. May drive a UPH vehicle, rental or own vehicle.\n        </div>"},
{"title": "Accounts Payable Specialist", "location": "Charleston, South Carolina Metropolitan Area", "level": "Entry level", "type": "Full-time", "function": "Accounting/Auditing and Finance", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>Ferretti Search is delighted to partner with our client to locate their next Accounts Payable Specialist.</p><p><br></p><p><strong>What will your day look like?</strong></p><ul><li>Reviewing all invoices for appropriate documentation and approval prior to payment</li><li>Processing check requests</li><li>Auditing and processing credit card bills</li><li>Matching invoices to checks, obtaining all signatures for checks, and distributing checks accordingly</li><li>Paying all produce bills/non-produce bills</li><li>Calling and/or emailing vendors for invoices when needed</li><li>Paying bills in a timely manner to ensure an excellent blue book rating</li><li>Researching short pays/balances to ensure full payments are made</li><li>Researching any differences with invoices and resolving them with vendors</li><li>Paying international vendors and executing wire transfers</li><li>Applying credit ONLY if the invoice is overpaid</li><li>Deducting payment if the product is returned and unaccepted</li><li>Working closely with the purchasing department</li><li>Boxing away paid invoices every 3 months</li><li>Responding to all vendor inquiries</li><li>Reconciling vendor statements, researching and correcting discrepancies</li><li>Assisting in month-end closing</li><li>Maintaining files and documentation thoroughly and accurately, following company policy and accepted accounting practices</li><li>Assisting with other projects as needed</li><li>Ensuring all payments are made out to the correct company</li><li>Giving invoices to department managers for approval</li></ul><p><br></p><p><strong>Who are you?</strong></p><ul><li>High School Diploma or GED required, BA degree preferred.</li><li>2+ years of Accounts Payable experience</li><li>Strong work ethics</li><li>Ability to follow standard filing procedures</li><li>Strong problem-solving skills, basic accounting principles knowledge, documentation skills, research and resolution skills, data analysis, and multitasking skills</li><li>Ability to perform mathematical computations such as percentages, fractions, addition, subtraction, multiplication, and division quickly and accurately</li><li>Knowledge of various collection techniques</li><li>Working knowledge of MS Office</li><li>Excellent communication and interpersonal skills</li></ul>\n        </div>"},
{"title": "Junior Graphic and UI/UX Designer", "location": "Columbus, OH", "level": "Entry level", "type": "Full-time", "function": "Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong><strong><strong>Junior Graphic and</strong> <strong>UI/UX Designer</strong></strong> (1 year experience, hybrid)<br><br></strong>Be part of our future! This job posting builds our talent pool for potential future openings. Well compare your skills and experience against both current and future needs. If theres a match, well contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.<br><br><strong>Hiring Type:</strong> Full-Time<br><br><strong>Base Salary:</strong> $60K-$70K Per Annum.<br><br><strong>About The Role<br><br></strong>As a Junior Graphic and UI/UX Designer working in our Design team, youll play a crucial role in creating visually appealing and user-centric designs for various digital platforms. You will collaborate with senior designers, and cross-functional teams, and contribute to the overall visual and interactive aspects of our projects.<br><br><strong>Key Responsibilities<br><br></strong><li>Graphic Design </li><ul><li>Assist in the creation of visually captivating marketing materials, presentations, and other graphic design collateral. </li><li>Support the design of social media content, email campaigns, and digital marketing assets. </li></ul><li>UI/UX Design </li><ul><li>Collaborate with senior designers and product teams to produce wireframes, mockups, and prototypes for websites and mobile apps. </li><li>Help create user-centered designs that align with project goals and user requirements. </li><li>Contribute to the development of intuitive user experiences by participating in design discussions and ideation sessions. </li><li>Design Support </li><ul><li>Assist in maintaining design guidelines and standards to ensure consistency across various projects. </li><li>Stay updated with design trends, tools, and best practices to enhance your design skills and contribute innovative ideas. <br></li></ul></ul><strong>Qualifications<br><br></strong><ul><li>Bachelors degree or equivalent in Graphic Design, UI/UX Design, or a related field. </li><li>A portfolio showcasing your graphic design and UI/UX skills, including projects and examples. </li><li>Proficiency in design tools such as Figma, Adobe Creative Suite (Illustrator, Photoshop, XD), or similar software. </li><li>Basic understanding of UI/UX principles and a strong desire to learn and grow in this field. </li><li>Attention to detail and effective communication of design concepts. </li><li>Ability to work collaboratively in a team, adapt to feedback, and incorporate changes into designs. </li><li>Strong attention to detail. Organized and reliable. Able and willing to present designs to groups of stakeholders. <br><br></li></ul><strong>Preferred Skills<br><br></strong><ul><li>Basic knowledge of HTML/CSS and responsive design principles</li></ul>\n        </div>"},
{"title": "Creative Director", "location": "Redmond, WA", "level": "Director", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          About us:Welcome to the heartbeat of Echelon Fitness, where we're not just raising the bar; we're rewriting the entire fitness playbook. Think of us as the rebels of the fitness worldthe ones who dare to blur the lines between sweat sessions and entertainment extravaganzas.<br><br>Here at Echelon, we're more than just a company; we're a movement. Picture a team of driven individuals who eat challenges for breakfast and wash them down with a protein shake. We're the tech junkies, the fitness fanatics, the creative sparks, and the unapologetic dreamers, all converging to create something truly extraordinary.<br><br>The Opportunity:Echelon is currently on the lookout for a creative director to join our team. The ideal candidate will have prior experience in a leadership role, preferably in the field of creative efficiency and will be responsible for providing strategic creative direction, designing innovative solutions that meet business goals and managing our talented creative team.<br><br><strong>Job Responsibilities<br><br></strong>Overseeing all creative projects from inception to completion.Working closely with the marketing team to develop creative strategies.Leading and inspiring the creative team to deliver top-notch, detail-oriented work.Staying updated on industry trends and implementing best practices for efficiency and creativity.Coordinating directly with clients and stakeholders to capture and realize their vision and objectives.Desired Qualifications:<br><br><strong>Skills<br><br></strong>Minimum 5 years of experience in a creative director role or similar.Bachelors degree in design, marketing, or a relevant field.Strong leadership skills, with a proven ability to manage creative teams.Excellent communication and presentation skills.Strong understanding of industry trends and creative tools.Nice-to-Haves:<br><br>Experience in the energy sector.A master's degree in a relevant field.Proven ability to work with various teams across an organization.Experience working with a diverse client base.Ability to travel as needed.Powered by JazzHRPI14ba99fccb6a-26289-34023666\n        </div>"},
{"title": "Creative Director", "location": "Carnation, WA", "level": "Director", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          About us:Welcome to the heartbeat of Echelon Fitness, where we're not just raising the bar; we're rewriting the entire fitness playbook. Think of us as the rebels of the fitness worldthe ones who dare to blur the lines between sweat sessions and entertainment extravaganzas.<br><br>Here at Echelon, we're more than just a company; we're a movement. Picture a team of driven individuals who eat challenges for breakfast and wash them down with a protein shake. We're the tech junkies, the fitness fanatics, the creative sparks, and the unapologetic dreamers, all converging to create something truly extraordinary.<br><br>The Opportunity:Echelon is currently on the lookout for a creative director to join our team. The ideal candidate will have prior experience in a leadership role, preferably in the field of creative efficiency and will be responsible for providing strategic creative direction, designing innovative solutions that meet business goals and managing our talented creative team.<br><br><strong>Job Responsibilities<br><br></strong>Overseeing all creative projects from inception to completion.Working closely with the marketing team to develop creative strategies.Leading and inspiring the creative team to deliver top-notch, detail-oriented work.Staying updated on industry trends and implementing best practices for efficiency and creativity.Coordinating directly with clients and stakeholders to capture and realize their vision and objectives.Desired Qualifications:<br><br><strong>Skills<br><br></strong>Minimum 5 years of experience in a creative director role or similar.Bachelors degree in design, marketing, or a relevant field.Strong leadership skills, with a proven ability to manage creative teams.Excellent communication and presentation skills.Strong understanding of industry trends and creative tools.Nice-to-Haves:<br><br>Experience in the energy sector.A master's degree in a relevant field.Proven ability to work with various teams across an organization.Experience working with a diverse client base.Ability to travel as needed.Powered by JazzHRPI14ba99fccb6a-26289-34023666\n        </div>"},
{"title": "Expression of Interest - People and Culture Manager", "location": "Chicago, IL", "level": "Entry level", "type": "Full-time", "function": "Human Resources", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          We are inviting professionals in high-growth industries who are thinking about their next move or looking for a new opportunity to join our expanding talent pool.<br><br>The F4S Talent Pool is a pilot project designed to:<br><br><ul><li>Help job seekers get discovered by our partners based on their anticipated hiring needs.</li><li>Provide optional support and resources for job seekers in their career endeavors.</li><li>Help individuals understand, and bring out the best in themselves and each other. <br><br></li></ul>The F4S Talent Pool process:<br><br>Once you express your interest, you will be asked to complete the F4S work style assessment which measures 48 key attitudes and motivations in the context of work. On completion, you will be automatically added to our growing talent pool and contacted as new opportunities arise.<br><br><strong>About Fingerprint For Success (F4S)<br><br></strong>Backed by 20+ years of research, F4S’s revolutionary predictive analytics have achieved over 90% reliability in forecasting personal and team motivations, behaviors, and performance. Ultimately, we help people find purpose and fulfillment at work, and help build and scale high-performing teams.<br><br>Keep in mind, joining our talent pool does not guarantee a job offer. We aim to balance your technical skills with the results of your F4S work style assessment to match the hiring needs of our partners.<br><br>Your feedback is a gift! Write to us via: to help co-create the future of recruitment, together.<br><br>Powered by JazzHR<br><br>OccAokLrNN\n        </div>"},
{"title": "Junior Web Developer", "location": "Charlotte, NC", "level": "Entry level", "type": "Full-time", "function": "Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong><strong>Junior Web Developer</strong> (1 year experience, hybrid)<br><br></strong>Be part of our future! This job posting builds our talent pool for potential future openings. Well compare your skills and experience against both current and future needs. If theres a match, well contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.<br><br><strong> Hiring Type:</strong> Full-Time<br><br><strong> Base Salary:</strong> $57K-$67K Per Annum.<br><br>Description:<br><br>You will work closely with our senior developers to design, develop, and maintain high-quality websites and web applications. This is an excellent opportunity to gain hands-on experience in a collaborative environment and contribute to exciting projects.<br><br>Responsibilities:<br><br><ul><li>Collaborate with the development team to understand project requirements and design web solutions </li><li>Write clean, efficient, and well-structured code using HTML, CSS, and JavaScript </li><li>Assist in the development and implementation of responsive and user-friendly web interfaces </li><li>Integrate front-end designs with back-end functionality using appropriate technologies </li><li>Conduct thorough testing and debugging to ensure seamless functionality </li><li>Assist in website maintenance, updates, and enhancements </li><li>Stay up-to-date with industry trends and emerging web development technologies </li><li>Collaborate with cross-functional teams to deliver projects on time and within scope </li><li>Document technical specifications, project details, and development processes <br><br></li></ul>Qualifications:<br><br><ul><li>Bachelors degree in Computer Science, Web Development, or a related field </li><li>Solid understanding of web development principles and best practices </li><li>Proficiency in HTML, CSS, and JavaScript </li><li>Familiarity with front-end frameworks such as Bootstrap or Foundation </li><li>Basic understanding of back-end development technologies (e.g., PHP, Python, or Ruby) </li><li>Knowledge of version control systems (e.g., Git) </li><li>Experience with responsive web design and mobile-first development </li><li>Strong problem-solving and analytical skills </li><li>Excellent communication and teamwork abilities </li><li>Self-motivated with a strong desire to learn and grow as a developer <br><br></li></ul>Preferred Qualifications:<br><br><ul><li>Previous experience with web development projects (personal or professional) </li><li>Knowledge of JavaScript frameworks/libraries (e.g., React, Angular, or Vue.js) </li><li>Familiarity with content management systems (e.g., WordPress, Drupal, or Joomla) </li><li>Understanding of SEO principles and best practices </li><li>Experience with web accessibility standards and guidelines </li><li>Knowledge of web security best practices</li></ul>\n        </div>"},
{"title": "Private Equity Associate", "location": "New York City Metropolitan Area", "level": "Associate", "type": "Full-time", "function": "Finance and Accounting/Auditing", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>Client Overview</strong></p><p>Our client is a leading large-cap fund specializing in technology investments, with a primary focus on Tech-Enabled Services and Software. </p><p><br></p><p><strong>Position Overview</strong></p><p>We are seeking a talented and motivated Associate to join our client's dynamic team. The successful candidate will play a key role in evaluating potential investment opportunities, conducting due diligence, and supporting portfolio company management teams to drive value creation and achieve strategic objectives.</p><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree in finance, business administration, or a related field; MBA or advanced degree preferred.</li><li>3 years of experience in an M&amp;A function at an Investment Bank or LBO experience at a Private Equity Firm.</li><li>Strong financial modeling, valuation, and analytical skills, with proficiency in Excel and financial modeling software.</li><li>Deep understanding of the technology industry, with specific knowledge of Tech-Enabled Services and Software</li><li>Excellent communication, presentation, and interpersonal skills, with the ability to interact effectively with senior executives and investment professionals.</li><li>Proven ability to manage multiple projects simultaneously and work effectively in a fast-paced, dynamic environment.</li><li>Self-starter with a strong work ethic, attention to detail, and a passion for investing and technology.</li></ul>\n        </div>"},
{"title": "Project Coordinator (Client Advisor)", "location": "Greater Pittsburgh Region", "level": "Entry level", "type": "Full-time", "function": "Administrative, Project Management, and Customer Service", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>Corbett Inc. is a commercial interiors consultant &amp; manufacturers rep group for KI furniture (www.ki.com) and other top lines. We are looking to bring on a results-oriented Client Advisor who specializes in preparing client specific proposals &amp; quotations utilizing our internal database to serve clients in the Pennsylvania, New Jersey, Delaware &amp; New York area.</p><p><br></p><p>Our Client Advisory team is looking for an energetic, coachable &amp; hard-working individual to help support our Project Managers. This role will serve as an overflow utility player for our Client Advisory team to perform as efficiently as possible!</p><p><br></p><p>Our ideal candidate will demonstrate superior customer service by combining system knowledge, sales, product &amp; problem-solving skills to exceed customer expectations. They will also possess excellent time management &amp; organization skills with the ability to meet important deadlines in a fast-paced environment.</p><p><br></p><p>This individual will work cross functionally with multiple manufacturers &amp; internal team members to ensure quotes are accurate, up to date and modified as necessary. This candidate should have strong communication skills and ability to work in a collaborative environment.</p><p><br></p><p>Corbett Inc.’s mission is to create better learning, working &amp; healing spaces for our clients.</p><p><br></p><p>Desired Skills &amp; Experience:</p><p>- Bachelor's degree</p><p>- Entry level position with growth opportunities</p><p>- Strong attention to detail</p><p>- Strong numerical skills</p><p>- Enjoys a consistent daily work routine</p><p>- Team player</p><p>- Independently performs tasks to completion</p><p>- Strong oral &amp; written communication</p><p>- Flexible work schedule</p><p>- Interest in commercial interiors, design, or architecture is a plus</p>\n        </div>"},
{"title": "Senior Vice President Field Operations", "location": "United States", "level": "Full-time", "type": "not-found", "function": "not-found", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><span>A US-based company is recruiting for the position of Senior Vice President Field Operations</span>.</p><p><br></p><p><br></p><p> <span>The Senior Vice President Field Operations, a senior executive role, oversees the day-to-day operations of a company, ensuring its overall efficiency and effectiveness</span>. </p><p><br></p><p>Operational Leadership: Senior Vice President Field Operations is responsible for providing strategic leadership and direction to all operational departments within the organization, including production, sales, marketing, finance, human resources, and logistics. They oversee the execution of operational plans and ensure that goals and objectives are achieved.</p><p><br></p><p>Process Optimization: Senior Vice President Field Operations identifies opportunities for process improvement and implements strategies to enhance operational efficiency. This includes streamlining workflows, eliminating bottlenecks, reducing costs, and implementing best practices to drive productivity and quality.</p><p><br></p><p>Performance Monitoring: Senior Vice President Field Operations establishes key performance indicators (KPIs) and metrics to measure the performance of various operational areas. They regularly monitor and analyze these metrics to assess the company's overall performance and make data-driven decisions to optimize operations.</p><p><br></p><p>Strategic Planning: Working closely with the Senior Vice President Field Operations and other executives, the Senior Vice President Field Operations participates in the development and execution of the company's strategic plans and initiatives. They provide input on operational feasibility, scalability, and resource allocation to support the company's growth objectives.</p><p><br></p><p>Cross-Functional Collaboration: Senior Vice President Field Operations fosters collaboration and alignment across different departments and functions within the organization. They work closely with other senior leaders to ensure seamless coordination and integration of operational activities, promoting a unified approach to achieving organizational goals.</p><p><br></p><p>Risk Management: Senior Vice President Field Operations identifies and manages operational risks and develops strategies to mitigate potential threats to the company's operations. They establish robust internal controls, compliance processes, and contingency plans to ensure business continuity.</p><p><br></p><p>Team Management: The senior Vice President Field Operations is responsible for building and leading a high-performing operational team. They recruit, train, mentor, and evaluate team members, promoting a culture of excellence, collaboration, and continuous improvement.</p><p><br></p><p>Stakeholder Management: Senior Vice President Field Operations interacts with various stakeholders, including board members, investors, clients, suppliers, and regulatory bodies. They represent the company in external forums and build strong relationships to support the organization's strategic objectives.</p><p><br></p><p>Overall, the Senior Vice President Field Operations plays a critical role in overseeing the operational aspects of a company, driving efficiency, and ensuring that all functions work together harmoniously to achieve the organization's goals.</p>\n        </div>"},
{"title": "Sales and Dealer Development Manager", "location": "Suwanee, GA", "level": "Mid-Senior level", "type": "Full-time", "function": "Sales and Business Development", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Summary<br><br></strong>Job Description<br><br>This position will establish, control, and oversee the activities for Kärcher Municipal Dealer Development, Sales, Marketing and Dealer Product Training. The primary focus will be the sale of Kärcher Municipal Equipment in the assigned Area of Responsibility (APR) in the AFL Dealer Territory for Kärcher Municipal. Secondary will be the establishment of an Industrial dealer network across the United States. (Dealer Network not currently established)<br><br>This position is for an individual that is looking to take their entrepreneurial expertise to a whole new level. This is a new industry for Atlanta Fork Lifts, Inc. and it creates the opportunity to build out a new business unit. It is a unique opportunity for someone that wants to create something from scratch and grow it into a thriving dealer network across the US.<br><br><strong>Job Description<br><br></strong>The position will develop and implement goals and objectives to meet strategic planning and profitable growth objectives for our company. This includes working with management on business planning, forecasting, budgeting, and expense control. This position will also assist with developing marketing material to promote equipment sales.<br><br>This position will also work with Parts, Service, Rental, and Used Equipment Sales to develop a fully rounded dealership and dealer network. Dealer network will require warranty, technical support, parts support, and distribution, etc. Position will be supported locally by Atlanta Fork Lifts, Inc., and Internationally by our manufacturer, Kärcher Municipal North America (KMNA) who is headquartered in Canada, and Boston, MA.<br><br><strong>Work Experience/Requirements<br><br></strong><ul><li>Bachelor’s degree in business related field preferred</li><li>5+ years’ experience in Material Handling Equipment or Industrial Sales<br><br></li></ul><strong>Skills·<br><br></strong>3+ years’ experience in managing/mentoring others.<br><br><ul><li>3+ years’ experience in managing/mentoring others. </li><li>Extensive knowledge of Industrial Floor Cleaning &amp; Street Cleaning Equipment</li><li>Demonstrate good leadership and decision-making skills. </li><li>Work effectively and interact with multiple levels within our organization. </li><li>Ability to read and interpret financial reports. </li><li>Excellent oral and written communication, organization, and presentation skills</li><li>Good knowledge of Microsoft Business Programs</li><li>Good driving record</li><li>Ability to work in a fast-paced environment. </li><li>Competitive spirit<br><br></li></ul><strong>Company Description<br><br></strong>Toyota Material Handling Systems is a Family owned business that was founded in 1973. We represent Toyota Industrial Equipment, the world’s largest forklift brand. We pride ourselves on providing world-class service to our customers at four facilities in Georgia. We have been recognized by Toyota for 15 consecutive years of Service Excellence and the prestigious ASEC award for outstanding customer service facilities and customer service.<br><br>Toyota Material Handling Systems is a Family owned business that was founded in 1973. We represent Toyota Industrial Equipment, the world’s largest forklift brand. We pride ourselves on providing world-class service to our customers at four facilities in Georgia. We have been recognized by Toyota for 15 consecutive years of Service Excellence and the prestigious ASEC award for outstanding customer service facilities and customer service.\n        </div>"},
{"title": "Creative Director", "location": "Kenmore, WA", "level": "Director", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          About us:Welcome to the heartbeat of Echelon Fitness, where we're not just raising the bar; we're rewriting the entire fitness playbook. Think of us as the rebels of the fitness worldthe ones who dare to blur the lines between sweat sessions and entertainment extravaganzas.<br><br>Here at Echelon, we're more than just a company; we're a movement. Picture a team of driven individuals who eat challenges for breakfast and wash them down with a protein shake. We're the tech junkies, the fitness fanatics, the creative sparks, and the unapologetic dreamers, all converging to create something truly extraordinary.<br><br>The Opportunity:Echelon is currently on the lookout for a creative director to join our team. The ideal candidate will have prior experience in a leadership role, preferably in the field of creative efficiency and will be responsible for providing strategic creative direction, designing innovative solutions that meet business goals and managing our talented creative team.<br><br><strong>Job Responsibilities<br><br></strong>Overseeing all creative projects from inception to completion.Working closely with the marketing team to develop creative strategies.Leading and inspiring the creative team to deliver top-notch, detail-oriented work.Staying updated on industry trends and implementing best practices for efficiency and creativity.Coordinating directly with clients and stakeholders to capture and realize their vision and objectives.Desired Qualifications:<br><br><strong>Skills<br><br></strong>Minimum 5 years of experience in a creative director role or similar.Bachelors degree in design, marketing, or a relevant field.Strong leadership skills, with a proven ability to manage creative teams.Excellent communication and presentation skills.Strong understanding of industry trends and creative tools.Nice-to-Haves:<br><br>Experience in the energy sector.A master's degree in a relevant field.Proven ability to work with various teams across an organization.Experience working with a diverse client base.Ability to travel as needed.Powered by JazzHRPI14ba99fccb6a-26289-34023666\n        </div>"},
{"title": "Administrative Assistant", "location": "Dallas, TX", "level": "Entry level", "type": "Full-time", "function": "Administrative", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Nemas International is looking for an administrative assistant to join our team remotely. This person will work to support the daily operations of the office.<br><br>The ideal candidate is a high-energy individual with excellent organizational skills, a strong attention to detail and the ability to communicate effectively in both written and verbal communications.<br><br>Responsibilities:<br><br><ul><li>Field inbound communications - Answer phone calls/general email inquiries and route to the appropriate internal parties as needed.</li><li>Coordinate scheduling - Set up meetings based on cross-functional availability for both internal and external stakeholders.</li><li>Organize internal resources - Build out and maintain processes to keep files and office supplies organized and easily accessible.</li><li>Liaise with visitors - Act as point person for office guests.</li><li>Communicate policies and procedures - Alert employees of new processes, rules and regulations.</li><li>Facilitate executive-level operations - Book travel, submit expense reports and send communications for high-level staff as needed.<br><br></li></ul>Requirements:<br><br><ul><li>High school diploma or equivalent.</li><li>1-2 years experience as an administrative assistant, secretary or receptionist preferred</li><li>Strong organizational, communication, and time-management skills</li><li>Proven ability to work in a fast-paced environment </li><li>Positive, high-energy attitude</li><li>Resourcefulness, creativity, and problem-solving skill set</li><li>Familiarity with office equipment (i.e. printers, fax machines, projectors)</li><li>Proficiency in Microsoft Office (especially MS Excel and PowerPoint)<br><br></li></ul>About Nemas International:<br><br>Nemas International is a full service provider of consumer product management, warranty and support for original equipment manufacturers and branded products throughout the Americas.<br><br>Our employees enjoy a work culture that promotes equality and diversity.<br><br>Nemas International benefits include health care, paid time off, retirement savings, employee assistance programs and professional development.<br><br>Employees can also take advantage of offerings like casual dress code, 401k, corporate discounts, and gym memberships etc.<br><br>Powered by JazzHR<br><br>K9evLNxguo\n        </div>"},
{"title": "Mid Market Account Director - Talent Solutions", "location": "New York, NY", "level": "Not Applicable", "type": "Full-time", "function": "Sales", "description": "<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>Company Description<br><br></strong>LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.<br><br>Join us to transform the way the world works.<br><br><strong>Job Description<br><br></strong>At LinkedIn, we trust each other to do our best work where it works best for us and our teams. This role offers a hybrid work option, meaning you can both work from home and commute to a LinkedIn office, depending on what’s best for you and when it is important for your team to be together.<br><br>We are looking for an Account Director to join our team as a trusted adviser with a relentless focus on bringing value to our customers within Mid-Market sector. You will be responsible for helping our customers effectively engage with our solutions (Talent &amp; Learning). You will be dedicated to making our customers stronger and seeking out opportunities for growth. Although you possess a strategic approach to selling and strive to meet/exceed revenue goals, you will always have your clients’ best interest in mind and act as their internal advocate to ensure they are set up for success.<br><br>Responsibilities:<br><br><ul><li>Researches Customer’s business and prepares thoughtful questions and insights in advance of customer meetings </li><li>Asks layered, open-ended questions to understand and clarify Customer’s objectives and challenges beyond surface-level detail </li><li>Builds relationships with multiple stakeholders (vertically and horizontally) across the Customer’s organization </li><li>Shifts communication style and content to fit the needs of different stakeholders </li><li>Leads with Solutions, not products, when making recommendations aligned to Customer objectives </li><li>Sells with Integrity </li><li>Drives customer decision making by achieving shared vision and proactively considering the value props that tie all stakeholders together </li><li>Thinks commercially and applies business acumen when crafting &amp; negotiating commercial agreements </li><li>Uses data and insights to support investment recommendations or overcome customer objections </li><li>Proactively mitigates churn risk by adopting a smart, customer-centric approach </li><li>Engages customers throughout to confirm and clarify value and adapts a strategy when needed to optimize ROI </li><li>Drives Customer growth by proactively identifying opportunities to deliver greater customer value </li><li>Applies business acumen in Account Planning by considering economic, industry, and company factors with a Customer-centric lens </li><li>Maps all key stakeholders in an account to assess the strength of the account relationship and create account outreach strategy </li><li>Agrees to joint accountability with colleagues and cross-functional teams for optimal customer success </li><li>Practices humility and asks for help from colleagues when faced with a challenge or unknown </li><li>Is disciplined in Territory and Account Planning, Forecasting, and Quota Attainment </li><li>Follows best practices when using CRM and other Sales tools in order to manage the Sales and Buyer cycles<br><br></li></ul><strong>Qualifications<br><br></strong>Basic Qualifications:<br><br><ul><li>4+ years of applicable sales experience <br><br></li></ul>Preferred Qualifications:<br><br><ul><li>Experience with HR software </li><li>BA/BS degree or equivalent in a related field </li><li>Experience with SaaS opportunities and Dynamics/D365 platform </li><li>Experience selling IT solutions </li><li>Knowledge of software contract terms and conditions with the ability to create fair transactions </li><li>Strong negotiation and accurate forecasting skills </li><li>Experience carrying a revenue target with the ability to develop compelling strategies that deliver results </li><li>Excellent communication, negotiation and forecasting skills </li><li>Demonstrated ability to find and manage high-level business in an evangelistic sales environment </li><li>Ability to gather and use data to inform decision making and persuade others </li><li>Ability to assess business opportunities and read prospective buyers </li><li>Ability to orchestrate the closure of business with an accurate understanding of prospect needs </li><li>Ability to include multiple partners and members of the company management team using competitive selling to position company products against direct and indirect competitors <br><br></li></ul>Suggested Skills:<br><br><ul><li>Sales Prospecting </li><li>Business Case Preparation </li><li>Multithreading </li><li>Influence at all levels </li><li>Active Listening <br><br></li></ul>LinkedIn is committed to fair and equitable compensation practices.<br><br>The pay range for this role is $122,000 to $175,000. Actual compensation packages are based on a wide array of factors unique to each candidate, including but not limited to skill set, years &amp; depth of experience, certifications and specific office location. This may differ in other locations due to cost of labor considerations.<br><br><strong>Additional Information<br><br></strong><strong>Equal Opportunity Statement<br><br></strong>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: EEO Statement_2020 - Signed.pdf.<br><br>Please reference the following information for more information: https://legal.linkedin.com/content/dam/legal/LinkedIn_EEO_Statement_2020.pdf.<br><br>Please reference the following information for more information: https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12ScreenRdr.pdf and<br><br>https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br><br>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.<br><br>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.<br><br>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:<br><br><ul><li>Documents in alternate formats or read aloud to you</li><li>Having interviews in an accessible location</li><li>Being accompanied by a service dog</li><li>Having a sign language interpreter present for the interview<br><br></li></ul>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.<br><br>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br><strong>San Francisco Fair Chance Ordinance <br><br></strong>Pursuant to the San Francisco Fair Chance Ordinance, LinkedIn will consider for employment qualified applicants with arrest and conviction records.<br><br><strong>Pay Transparency Policy Statement <br><br></strong>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br><strong>Global Data Privacy Notice for Job Candidates <br><br></strong>Please follow this link to access the document that provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal.<br><br><br><strong>Equal Opportunity Statement<br></strong>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br> <br>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response.<br> <br>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days.<br> <br> LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br><br><strong>Pay Transparency Policy Statement<br></strong>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br><br><strong>Global Data Privacy Notice for Job Candidates<br></strong>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice<br>\n        </div>"}
]