[
{"title": "Assistant Administrator (Remote)", "location": "Jacksonville, FL", "level": "Entry level", "type": "Full-time", "function": "Information Technology", "description": ["As a Remote Assistant Administrator - Travel Associate, you will play a crucial role in supporting the efficient functioning of the administrative and travel-related aspects of the organization. This position is remote, requiring a self-motivated and detail-oriented individual who can effectively manage administrative tasks and coordinate travel arrangements for the team.", "Key Responsibilities:", "Administrative Support:", "Handle general administrative tasks such as email correspondence, scheduling meetings, and managing calendars.", "Organize and maintain files, records, and documentation for easy retrieval.", "Assist in preparing reports, presentations, and other documents as needed.", "Travel Coordination:", "Manage travel arrangements, including flight bookings, hotel accommodations, ground transportation, and itineraries.", "Ensure compliance with the organization's travel policies and guidelines.", "Coordinate travel logistics for team members, considering preferences and budget constraints.", "Communication Liaison:", "Serve as a point of contact for internal and external communication related to travel plans and administrative matters.", "Facilitate communication between team members and external stakeholders regarding travel details.", "Expense Management:", "Assist in tracking and managing travel-related expenses.", "Reconcile travel expenses and ensure timely submission of expense reports.", "Remote Support:", "Collaborate with team members working remotely to provide necessary administrative support.", "Utilize virtual communication tools effectively to stay connected with the team.", "Qualifications:", "Strong organizational and time management skills with attention to detail.", "Excellent written and verbal communication skills.", "Proficient in using office productivity tools such as Microsoft Office or Google Workspace.", "Ability to work independently and remotely with minimal supervision.", "Must be eligible to work in the United States.", "Working Conditions:", "This is a remote position, requiring a reliable internet connection and a dedicated workspace.", "Flexible working hours may be required to accommodate different time zones or urgent tasks. Salary: Based off commissions and performance.", "Powered by JazzHR", "43og7W3LCC"]},
{"title": "Global Talent Acquisition Manager", "location": "Irvine, CA", "level": "Mid-Senior level", "type": "Full-time", "function": "Human Resources", "description": ["", "About Us:", "At Assistantly, we are dedicated to pushing boundaries and fostering an environment where innovation thrives. We understand that our people are our greatest asset, and we are committed to attracting, developing, and retaining the best talent worldwide. As we continue to grow, we are looking for a dynamic Global Talent Acquisition Manager to lead our efforts in sculpting a candidate experience that sets us apart and ensures we engage with the finest minds across the globe.", "Role Overview:", "The Global Talent Acquisition Manager will be at the forefront of our efforts to identify, attract, and onboard top-tier talent. This pivotal role demands a strategic thinker with a knack for excellence, ready to redefine our talent acquisition strategy, especially in LATAM, the Philippines, and Eastern Europe. Your mission will be to ensure our talent pool is not just vast but filled with the highest quality candidates, ready to contribute to our ambitious goals.", "Key Responsibilities:", "Elevate Candidate Experience: Craft and implement strategies that enhance our candidate journey, making it second to none. Ensure each touchpoint reflects our brand and values, fostering a positive and engaging experience", "Talent Pool Management: Actively maintain and enrich our global talent pool. Develop a keen understanding of our industry's landscape to strategically position us as the employer of choice for top candidates", "Recruitment Oversight: Lead and support our team of recruiters, providing guidance on open assignments and ensuring alignment with our global talent acquisition strategy. Monitor performance and drive accountability to meet hiring goals", "Global Recruitment: Spearhead recruitment initiatives across LATAM, the Philippines, and Eastern Europe, leveraging your expertise and networks in these regions. Build and maintain relationships with local recruitment agencies and platforms to enhance our reach", "Process and System Enhancement: Evaluate, design, and implement recruitment processes and systems that boost efficiency and effectiveness. Ensure our ATS (Applicant Tracking System) is utilized to its full potential, enhancing data-driven recruitment decisions", "Team Leadership and Development: Inspire and mentor the recruitment team. Foster an environment of continuous learning and development, encouraging innovation and excellence in all recruitment practices", "Why Assistantly?", "We're more than a company; we're a movement. By joining us, you're not just making a career choice; you're making a statement that you believe in the future of work, the power of global talent, and the potential of every individual to contribute to something greater. Ready to run the show and lead us into an exhilarating future? Let's make history together.", "Why Join Us:", "Assistantly offers a unique opportunity to contribute to a rapidly growing organization that values creativity, innovation, and diversity. We provide a platform for you to excel, alongside a team of passionate professionals committed to making a difference. Join us in shaping the future of our industry, one talent at a time.", "Requirements", "What We're Looking For:", "Global Recruitment Experience: Proven track record of successful talent acquisition in LATAM, the Philippines, and Eastern Europe. Familiarity with the nuances of recruiting in these regions is crucial", "Leadership and Strategy: Exceptional leadership skills with the ability to develop and execute a comprehensive global talent acquisition strategy", "Hands-on Approach: Ready to roll up your sleeves and dive deep into operational details. Demonstrated ability to provide immediate impact and value", "Process Innovation: Experience in building, optimizing, and implementing recruitment processes and systems. Proficient in utilizing ATS for streamlined talent management", "Collaborative Mindset: Strong interpersonal and communication skills, capable of building relationships across teams and with external partners globally", "Adaptability and Eagerness to Learn: Open to new challenges, eager to learn, and willing to adapt to the dynamic needs of the business. Ready to start and make a significant impact immediately", "Benefits", "Fully-Remote", "High Bonus Potential + Base", "Generous PTO", "Mission & Value Driven Company", "Opportunity for Internal Growth", ""]},
{"title": "Vice President of Strategic Initiatives - Clinic", "location": "Clearwater, FL", "level": "Executive", "type": "Full-time", "function": "Business Development and Sales", "description": ["", "Job Description", "Do you envision working for a dynamic, mission-driven organization that supports the community while fostering an employee culture of appreciation and fun? If your answer is yes, then an employment opportunity at Directions for Living may be a great fit for you! We offer an excellent salary and benefits package to include employer-paid health insurance premiums for all full-time employees, PTO and paid company holidays, 403b retirement, EAP, and year-round employee wellness and appreciation initiatives.", "Position Summary:", "The Vice President of Strategic Initiatives reports to and is responsible to the President & Chief Executive Officer (CEO) of the agency. The Vice President of Strategic Initiatives participates in the Executive Leadership Team in developing and implementing a mission, vision, and strategic plan for the agency, setting annual objectives for service programs, and ensuring the implementation of action plans to achieve objectives. The Vice President of Strategic Initiatives will partner with his/her peer (VP-level executives) and will be responsible for developing, implementing, and managing, in conjunction with the Vice President of Finance, the operational aspect of the annual budget. The Vice President of Strategic Initiatives represents the agency to all constituencies as designated by the President & CEO. The Vice President of Strategic Initiatives will cultivate existing relationships with public and private funders. Provide effective and inspiring leadership by being actively involved in all programs and services, developing a broad and deep knowledge of all programs Identify opportunities for Directions for Living to leverage cross-program strengths to take advantage of new opportunities and/or to address agency challenges.", "This is a key performance indicator.", "Lead, coach, develop, and retain Directions for Living high-performance senior management team with an emphasis on developing capacity in strategic analysis and planning, and program budgeting", "Directions for Living is an essential services provider. All Directions for Living employees must be willing and able to provide vital support and essential services to the people that we serve in the event of an emergency, pandemic or other disaster situation.", "EDUCATION EXPERIENCE/REQUIREMENTS:", "Must hold a Master's level degree from an accredited program in business, psychology, administration, social work, psychology, nursing, or a related field. At least ten (10) plus years of relevant experience in senior administrative or clinical programming.", "Clinical and supervisory experience with progressive responsibilities for at least five (5) years.", "LCSW or LMHC preferred.", "Previous experience in Child Welfare is a plus.", "EOE/ADA/DFW", "Smoke Free Campus", "Company Description", "Our mission is to be a welcoming and compassionate provider, advocate, and partner to children, adults, and families in need of integrated healthcare, social support, safety, and hope for the future.", "Thriving children. Empowered adults. Strong families.", "Our mission is to be a welcoming and compassionate provider, advocate, and partner to children, adults, and families in need of integrated healthcare, social support, safety, and hope for the future. Thriving children. Empowered adults. Strong families."]},
{"title": "Corporate Vice President", "location": "Washington, DC", "level": "Executive", "type": "Full-time", "function": "Business Development and Sales", "description": ["", "Job Description", "This position is responsible for providing operational oversight and direction to IFAS direct billable personnel within the Integrated Financial Solutions practice area. This includes employee development and training, annual evaluations, goal setting, and approving timesheets and PTO requests. Other responsibilities include the following:", "Serving as hiring manager to staff contracts within this practice area to including working with IFAS Talent Acquisition team to perform interviews, provide candidate evaluations and ultimately recommend new hires.", "Organizing and/or providing monthly Program Management Review (PMR) briefings.", "Ensuring Program Status Reviews are being conducted with clients and IFAS Executive Leadership.", "Establishing and maintaining effective Client Relationship Management to help ensure customer satisfaction.", "Serving as Capture Manager and/or Subject Matter Expert to help with pursuit, writing, and production of proposals to support new business development efforts within this practice area.", "Serving as Color Team Review member to support proposals across IFAS practice areas, contracts and/or customer base.", "Providing Opportunity Review briefings to ensure IFAS executive leadership is aware and approves pursuit of new business efforts.", "Entering and updating pipeline tool to ensure opportunities are effectively tracked throughout the business development Lifecyle.", "Representing IFAS at industry events to include tradeshows, conferences, and government Industry Days.", "Establishing and maintaining strong relationships with current or potential industry teaming partners.", "Skills", "Strong oral and written communications and interpersonal skills to guide employees and work with the President and CEO as well as effectively communicate with cross-functional teams and stakeholders.", "Time management to effectively organize and deliver tasks on time.", "Strong analytical and decision-making skills.", "Financial management acumen to include the ability to manage budgets, cost control, and financial planning.", "Ability to lead and drive organizational change as necessary.", "Strategic planning skills to contribute to long-term organizational goals.", "Qualifications", "At least 15 years of related experience supporting federal government clients especially providing financial management and/or IT support services.", "Prior senior leadership experience preferably at the Director level or above", "Min of BA, Master’s Degree in Business preferred", "IFAS is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class.", "Company Description", "Integrated Finance and Accounting Solutions (IFAS) is a service-disabled veteran, woman owned small disadvantaged business firm that applies integrated finance and accounting solutions to every engagement to help clients build sustain, and maintain a profitable business model. We do this with a corporate commitment to provide on time service that is mission focused and results driven. It is our true belief that finding the right solutions to your business' mission makes doing business less challenging. IFAS' core capabilities include business & Finance operations, IT Support Services, Acquisition and logistics support.", "We are an equal opportunity employer.", "Integrated Finance and Accounting Solutions (IFAS) is a service-disabled veteran, woman owned small disadvantaged business firm that applies integrated finance and accounting solutions to every engagement to help clients build sustain, and maintain a profitable business model. We do this with a corporate commitment to provide on time service that is mission focused and results driven. It is our true belief that finding the right solutions to your business' mission makes doing business less challenging. IFAS' core capabilities include business & Finance operations, IT Support Services, Acquisition and logistics support. We are an equal opportunity employer."]},
{"title": "Hourly Part-Time Tequila Brand Ambassador for Tastings & Demos", "location": "San Diego, CA", "level": "Entry level", "type": "Part-time", "function": "Sales and Business Development", "description": ["", "Job Description", "Perform demos and tastings for retail stores in the San Diego area. Pour tequila samples, educate customers on the key selling points, pass out merch and swag, and promote in-store sales.", "NEED someone for this Friday's 3/29/24 Demo (sampling tequila, hand out swag) from 4-7pm."]},
{"title": "Work from Home Scheduler", "location": "United States", "level": "Entry level", "type": "Full-time", "function": "Management and Manufacturing", "description": ["Looking for a remote travel scheduling specialist who love to have fun booking travel. Duties include arranging transportation, accommodations, and entertainment for families, couples and individual travelers.", "Agents may also specialize by type of travel, such as leisure or business, or by destination. They will also promote travel packages on behalf of cruise lines, resorts, and specialty travel groups.", "Benefits", "Flexible schedule", "Travel discounts", "Tips", "On-the-job-training", "Generous commissions and incredible opportunity!", "ROLES & RESPONSIBILITY", "Book vacations for clients", "Talk to vendors on behalf of the clients", "Ability to interact, communicate and negotiate effectively", "Requirements", "Must be 18+", "Attend webinar training is a must for future travels", "Must have a computer or a cellphone", "High School Diploma or GED Equivalent", "Ability to interact, communicate and negotiate effectively", "Previous experience in customer service is a plus, but not required.", "Skills", "Self-Motivated", "Internet savvy", "Excellent interpersonal Communication Skills", "Powered by JazzHR", "wnWgok7RwF"]},
{"title": "Corporate Recruiter", "location": "Atlanta Metropolitan Area", "level": "Mid-Senior level", "type": "Contract", "function": "Human Resources", "description": ["", "Position:", "Senior Recruiter", "Location:", "Atlanta, GA, for occasional office meetings.", "Overview:", "The Senior Recruiter will be responsible for managing recruitment efforts for designated areas within a major Enterprise. This role involves developing talent acquisition strategies in collaboration with HR and Talent Acquisition leadership, managing the full recruitment lifecycle, and ensuring the best hiring decisions are made. Strong communication, relationship-building, and project-planning skills are essential for success in this role.", "Major Tasks and Responsibilities:", "Develop and implement function-specific talent acquisition plans based on strategic planning information to build a strong external talent pool.", "Perform full lifecycle recruiting, including sourcing, screening, interviewing, and salary negotiation with a focus on diversity.", "Maintain communication with business partners to ensure staffing effectiveness and efficiency.", "Execute recruitment plans to achieve staffing metrics and provide status reports on candidate quality, throughput, and time to offer.", "Build and maintain strong relationships with stakeholders to meet talent acquisition goals and resolve issues.", "Develop individualized sourcing strategies, including cold calling, networking, and engaging passive candidates.", "Ensure compliance with federal, state, and local laws as well as company policies in all talent acquisition activities.", "Required Skills and Background:", "Bachelor's degree.", "4+ years of recruiting experience focusing on Professional-level resources such as IT, Finance, Supply Chain, and Marketing.", "Full lifecycle recruiting experience, including stakeholder management, sourcing, candidate presentation, and process management.", "Excellent interpersonal, collaboration, and communication skills.", "Familiarity with Applicant Tracking Systems (ATS) and Human Capital Management (HCM) systems.", "Ability to define recruiting strategy and fulfillment planning.", "Proven track record of finding and filling niche professional skills.", "This position offers 100% remote work with occasional office meetings in Atlanta, GA. The Senior Recruiter will play a crucial role in attracting and hiring top talent to support the enterprise's functional areas.", ""]},
{"title": "Senior Marketing Manager", "location": "Charlotte, NC", "level": "Mid-Senior level", "type": "Full-time", "function": "Marketing and Sales", "description": ["", "Company Description", "Truly Good Foods is a family-owned company founded in 1977 by Jerry and Betty York. It is certified in the Women's Business Enterprise National Council (WBENC) and the Women-Owned Small Business Program (WOSB). Our goal is to create the tastiest snacks for families to share for generations. With a product line of more than 3,000 snacks, Truly Good Foods is a nationwide snack partner for businesses. We operate nationwide with sales and distribution offices in Reno, Orlando, Atlanta, Memphis, Washington DC, Dallas, and our headquarters is located in Charlotte, North Carolina.", "Role Description", "Customer Channel Marketing Strategy:", "• Develop and implement comprehensive marketing plans for each foodservice customer channel,", "considering unique demographics and preferences.", "• Manage marketing activities to support and drive key results, sales and profit growth, and account", "penetration. Maximize opportunities in key market segments.", "• Develop detailed project plans and lead cross-functional teams to meet critical deadlines, deliverables,", "and budgets.", "• Assess local sponsorship and partnership opportunities with marketing leadership.", "Marketing Operations Optimization:", "• Facilitate linkage between Hubspot Marketing and Sales capabilities and collaborate to develop digital", "solutions for customer needs.", "• Implement and optimize sales and marketing processes for seamless execution of channel-specific", "campaigns.", "• Work closely with internal teams to ensure efficient workflows and timely delivery of marketing-led", "initiatives.", "Sales Collaboration:", "• Work in tandem with sales teams to understand customer needs, market trends and competitive", "landscape.", "• Collaborate with sales to align channel strategies with revenue and growth targets.", "• Build sales enablement materials and support to enhance campaign effectiveness.", "Brand Development & Positioning:", "• Drive brand development initiatives specific to each customer channel, ensuring consistent messaging", "and positioning.", "• Collaborate with design and content teams to create visually compelling and on-brand materials.", "Analytics & Reporting:", "• Utilize data analytics tools to measure and analyze the performance of marketing campaigns.", "• Provide detailed reports on key performance indicators and actionable insights for continuous", "improvement.", "Qualifications & Experience", "• Bachelor's degree (B. A.) in marketing or related field from four-year college or university; and ten plus", "years related experience in marketing, with specific focus on customer channel marketing within the", "food industry a plus.", "• Minimum 10 years’ experience in marketing, with specific focus on customer channel marketing within", "the food industry a plus", "• Strong strategic thinking, analytical, and problem-solving skills.", "• Excellent leadership, collaboration, and communication abilities.", "• Results-oriented, with strong organizational skills, project management skills, and the ability to multitask.", "• Marketing automation experience preferred, with Hubspot CRM platform expertise a plus.", ""]},
{"title": "Internet-Based Hotel Scheduler (Remote)", "location": "United States", "level": "Entry level", "type": "Full-time", "function": "Management and Manufacturing", "description": ["We're on the lookout for a meticulous and customer-centric Remote Hotel Scheduler to join our team. Your primary focus will be on managing room reservations and booking accommodations for our clients. If you possess outstanding communication skills, a warm demeanor, and a love for hospitality, we encourage you to submit your application.", "Responsibilities:", "Handle all aspects of hotel reservations, from receiving inquiries to confirming room availability and making bookings.", "Engage with guests via phone, email, and in-person interactions to address reservation inquiries, modifications, and cancellations.", "Facilitate smooth check-in and check-out experiences for guests, addressing any special requests or concerns they may have.", "Process payments, manage reservations, and issue invoices or receipts as required.", "This role is fully remote, offering you the flexibility to work from the comfort of your own home or any location with an internet connection. We understand the importance of work-life balance and empower you to manage your workload according to your lifestyle.", "Moreover, this position isn't just a job; it's an opportunity to build your own business within our framework. With dedication and hard work, you can shape your financial future while enjoying the support and resources we provide. You'll have the chance to turn your passion for hospitality into a thriving career.", "Here's what we offer:", "One of the highest paid out travel commissions in the industry based on your successful bookings.", "Comprehensive training and ongoing development programs to ensure your success.", "A dynamic and supportive community of like-minded individuals who are passionate about what they do.", "Exposure to a diverse range of projects, from corporate conferences to weddings, allowing you to gain valuable experience and expand your skill set.", "Travel perks, competitive salary, and a flexible remote work environment.", "Qualifications:", "Excellent communication and interpersonal skills, coupled with a welcoming attitude.", "Strong organizational skills and the ability to multitask effectively.", "Attention to detail and accuracy in all tasks.", "Ability to work independently as well as part of a team.", "Proficient knowledge of travel destinations, attractions, and various travel products and services.", "Exceptional customer service and problem-solving abilities.", "A genuine passion for travel and a desire to help others create memorable experiences.", "Must be at least 18 years old and a US resident.", "Join us and embark on an exciting journey where your expertise and hard work are truly valued.", "Powered by JazzHR", "4YpRPVSrCh"]},
{"title": "Account Executive", "location": "New York, NY", "level": "Associate", "type": "Full-time", "function": "Public Relations and Marketing", "description": ["", "The Role", "Smarts is looking for an experienced Public Relations Account Executive to support a portfolio of spirits accounts focused on integrated marketing (earned media, partnerships, events, etc.), inclusive of cultural strategy, account and client management, and PR activation, with a heavy focus on media relations.", "As a PR Account Executive, you will be able to use your ability to navigate the ever-changing earned media landscape to research, plan and execute exciting culture-focused activations for your clients. This client-facing position requires excellent communication, a proactive mindset, organizational skills and a fundamental understanding of media relations.", "This role will be based in New York City. The role is hybrid, providing flexibility to work from home 2-3 days per week and be based in the office the remaining time.", "Responsibilities include but are not limited to:", "Account & Client Management", "Support day-to-day management of account programs and develop agendas, recaps, memos and other client-facing correspondence materials in partnership with the account team", "Attend regular client meetings and conference calls, participating confidently in all client communications across multiple channels – e.g. email, phone, Zoom, face to face; responsible for detailed note taking, identifying key next steps for all parties involved", "Manage detailed timelines and deliverables for each account and proactively communicate status on projects internally with agency leadership and externally with client", "Work collaboratively with cross-agency functions for broader client programs and activations", "Media Relations & Writing", "Research, uncover and develop story angles that will drive media interest, press coverage and conversation for client campaigns", "Craft press releases, press kit materials, pitches, media alerts, etc., and distribute them accordingly", "Pitch relevant media and contribute to cultivating long-term relationships with key lifestyle, fashion, fitness, business, culinary, sports and consumer media and influencers on behalf of clients", "Own product inventory seeding, product ordering for press opportunities and organization of product inventory", "Secure quality media placements (online, print, broadcast, etc.) as necessary for each brand’s target audience", "Research & Insights", "Stay on the pulse of cultural moments, industry trends and emerging technologies, and demonstrate an understanding of how they integrate into communications programs", "Support our new business drive through robust research as required; from exploring industry trends to gathering competitive intelligence", "Qualifications & Experience", "At least 3 years of relevant experience in integrated communications or public relations fields (lifestyle consumer brand experience preferred)", "Bachelor’s degree in a public relations or communications-relevant field from an accredited college or university", "A solid grasp of all basic public relations tools – including an advanced ability in research, writing and editing, and developing/maintaining media relationships – and how they are used to achieve client goals", "Excellent written and verbal communication skills with the ability to communicate with multiple levels of internal staff and external clients", "A fundamental understanding of media outreach assignments, the ability to apply experience and initiative in developing media strategies, and a solid track record of earned media placements", "The interest and drive to stay on top of trends and proactively recommend opportunities for insertion of clients in culturally relevant moments", "A proactive, solutions-oriented approach to work, the ability to multi-task in a fast-paced environment, and be a team player", "About SMARTS", "Smarts is one of the UK’s largest consumer PR and content agencies and we’re growing. From our offices in New York, London, Belfast, Glasgow and Amsterdam, our 160+ team delivers creative, award-winning work nationally and internationally for brands like Booking.com, Balcones Distilling, Smirnoff and Zalando. A multi-disciplinary agency, our expertise stretches beyond traditional PR and media relations, into social and digital, influencer partnerships, content creation and more.", "Smarts is a global Cultural Communications agency that specializes in activating through Public Relations, Strategic Partnerships, Influencer engagement, and content generation. We pride ourselves in the deep understanding of consumer passions, finding brands’ role in culture and connecting the two.", "Salary Range:", "$54,250 - $67,750", ""]},
{"title": "REMOTE CRUISE PLANNER", "location": "California, United States", "level": "Entry level", "type": "Full-time", "function": "Other", "description": ["A remote cruise planner is a specialized professional who assists individuals or groups in planning and organizing cruise vacations. Here's a detailed description of their role and responsibilities:", "Cruise Destination Expertise: Remote cruise planners have extensive knowledge of cruise destinations worldwide, including popular ports of call, scenic routes, and cruise lines that offer friendly amenities. They stay informed about travel restrictions, health protocols, and internet connectivity options to recommend cruises that align with clients' travel preferences.", "Personalized Consultation: Planners conduct thorough consultations with clients to understand their specific goals, preferences, and constraints regarding cruise vacations. Whether clients seek a short-term escape, a long-term adventure, or a corporate retreat at sea, planners tailor their recommendations and services to meet individual needs.", "Accommodation Selection: Planners help clients select cabins or suites suitable to their travel plans. Whether clients prefer cabins with reliable internet access, spacious work desks, or private balconies for scenic views, planners recommend accommodations that offer the comfort and amenities needed while at sea.", "Travel Management: Remote cruise planners handle various travel logistics, including cruise bookings, transportation arrangements, travel insurance, and itinerary coordination.", "Overall, a remote cruise planner plays a crucial role in helping clients enjoy the best of both worlds – whether combining work and leisure while cruising the seas. By offering personalized consultation, destination expertise, and ongoing assistance, planners empower clients to embark on unforgettable remote cruise vacations tailored to their unique preferences and needs.", "This is not a job, it is a 1099 business opportunity.", "Powered by JazzHR", "pWXdWaym4V"]},
{"title": "Director Demand Planning", "location": "Los Angeles, CA", "level": "Director", "type": "Full-time", "function": "Management and Manufacturing", "description": ["The Demand Planning Director is responsible for maintaining 18 month rolling forecast by SKU for Domestic, International and Ecommerce Channel. Will develop and lead the global demand planning function and create standard work and practices.", "Define and mature a best-in-class S&OP calendar with all functional partners, Supply Planning, Finance, Commercial, Distribution.", "Partner with sales channels to understand retailer product demands (promotions, marketing events, new products, door changes, etc). Provide trends, forecast misses and other intelligence to help inform sales channels during demand alignment meetings.", "Provide analytical support for new product launches and account initiatives to inform pipe, replenishment and returns exposure.", "Lead and implement planning platform.", "Essential Job Functions:", "Oversee the development and own an 18-month baseline forecast by SKU.", "Conduct monthly Demand Review with Commercial, to obtain new launch STT dates, SKU discontinuation dates, door openings/expansions/closures, and other Commercial inputs.", "Prepare 18-month rolling forecast for Commercial review and consensus during monthly demand consensus meetings.", "Present in Pre-S&OP meeting actuals vs prior month plan, future risk and gap closure scenarios for alignment of forward 18-month forecast.", "Prepare and present Executive S&OP deck.", "Document and track assumptions underlying actuals and 18 month forecast.", "Provide forecast accuracy metrics at the Global, Channel, Retailer, Product Family, Product Set on a monthly basis.", "Participate in evaluating feasibility of new business opportunities with Finance and Commercial teams.", "Manage a team of 2 direct reports, providing coaching time management and communication, and deliver a best-in-class demand planning process.", "Requirements:", "Bachelor’s Degree", "10+ years Demand Planning in high SKU CPG environment. Cosmetics industry helpful.", "5+ years leading S&OP activities.", "ERP experience required.", "Familiarity with advanced planning platform required (APO, Blue Ridge, Demand Caster, Logility, etc).", "Advanced Excel required.", "Strong supply chain acumen with understanding of drivers that impact demand/supply (MOQs, lead time, logistics).", "Understanding of inventory principles (safety/cycle stock, retail replenishment, inventory turns, weeks of coverage etc).", "Strong communication skills to influence collaboratively across functions.", "International demand planning experience a plus.", "Excellent analytical, presentation and writing skills", "Proven leadership skills including experience building/leading high performing teams.", "Hybrid position in Los Angeles. Candidate must be able to commute to Beverly Hills 1-2 times a week.", "Anastasia Beverly Hills offers a competitive compensation package with full benefits and a 401(K) plan with matching contributions from the company. The starting base salary range for this position in the selected city is $150,000.00-$165000.00 yearly. Compensation may vary outside of this range depending on several factors, including a candidate’s qualifications, skills, competencies, experience, and geographical location. Base pay is one part of the total compensation package that is provided to compensate and recognize employees for their work. This role is bonus eligible.", "Powered by JazzHR", "fiYuoIN2Bs"]},
{"title": "Research & Scheduling Assistant /ONLINE", "location": "Carson City, NV", "level": "Entry level", "type": "Full-time", "function": "Management and Manufacturing", "description": ["A love of travel attracts many people to the field, but to succeed, a Research & Scheduling Assistant must be passionate about travel and the endless opportunities it brings to bridge history, cultures and cuisine. Successful Research & Scheduling Assistants must have a strong sales drive, organizational skills with an eye for detail, ability to multi-task in a fast-paced environment, demonstrated proficiency in navigating computers and various programs; must possess good written and oral communication skills and the ability and interest to be in a continuous learning curve.", "Working with us takes a certain kind of person; we want someone who identifies with our values and is willing to challenge themselves both personally and professionally. We seek individuals who are passionate about serving and making a difference in the lives of others.", "We have an amazing opportunity to build dream vacations and plan cruise itineraries with the biggest names in the travel industry!", "️Job Description:", "Arrange Cruise Travel for vacations, honeymoons, weddings and more", "Determine customer's needs and preferences, such as schedules, costs and payment plans", "Plan and arrange tour packages, excursions, and day trips", "Book reservations for travel, hotel, flights, rental cars, special events, honeymoons", "Benefits:", "Full Training Provided", "Work PT or FT", "No experience necessary", "Travel Perks", "Licensed & Bonded", "Personal Website", "Daily Training Available", "Certification provided", "Remote Business Opportunity", "️Requirements:", "Must be 18+", "Computer with good WiFi", "Self Motivated", "Detail Oriented", "Customer Service Skills is a plus", "This entry-level position serves as your gateway into the vibrant world of the travel industry. Taking this first step allows you to make a positive impact on travelers' lives while fostering your professional growth. Explore the world, one exceptional experience at a time – commence your entrepreneurial journey today.", "1099 Business Opportunity not a job", "Available in USA, United Kingdom, Argentina, Australia, Mexico, Costa Rica, Panama, Peru", "Powered by JazzHR", "Lw1YRkffFu"]},
{"title": "Architectural Drafter", "location": "Lancaster, PA", "level": "Entry level", "type": "Full-time", "function": "Design, Art/Creative, and Information Technology", "description": ["", "Job Description", "You can Make Your Mark at Charter.", "If you have at least two years of architectural drafting experience and are ready to take your career to the next level, now is the time for you to join our team as an", "Architectural Drafter", "and be a part of creating award winning architectural designs in the most recognized neighborhoods in the region.", "This position is responsible for delivering complete architectural plan sets on schedule.", "At Charter, you'll have the opportunity to work alongside people like you who want to be the best at what they do while demonstrating a caring attitude, the ability to work smart, and belief in yourself.", "Charter Homes & Neighborhoods is one of the recognized names in the homebuilding industry both regionally and nationally. We have earned countless awards, including the Best Neighborhood in the Country and the National Housing Quality Award, the highest industry achievement. Over the past 30 years, we have delivered more than 5,000 homes and currently have neighborhoods open across Pennsylvania.", "This position includes a competitive salary, a health plan that includes medical, vision, dental, and prescription drugs, paid vacation, a 401K, short and long term disability, and a flexible spending account. For more information about our company and the benefits of joining us, visit", "WorkatCharter.com", ".", "This position requires two years of experience using Revit as related to creating residential and/or commercial architectural construction documents in conjunction with a strong understanding of building systems and construction.", "Submit your resume today!", "Company Description", "Charter Homes & Neighborhoods is one of the recognized names in the homebuilding industry both regionally and nationally. We have earned countless awards, including the Best Neighborhood in the Country and the National Housing Quality Award, the highest industry achievement. Over the past 30 years, we have delivered over 5,000 homes in neighborhoods across Pennsylvania.", "Charter Homes & Neighborhoods is one of the recognized names in the homebuilding industry both regionally and nationally. We have earned countless awards, including the Best Neighborhood in the Country and the National Housing Quality Award, the highest industry achievement. Over the past 30 years, we have delivered over 5,000 homes in neighborhoods across Pennsylvania."]},
{"title": "Land Development Manager", "location": "St Charles, MO", "level": "Mid-Senior level", "type": "Full-time", "function": "Management and Manufacturing", "description": ["", "Overview", "Job Description", "This position will lead in the development of land for a successful homebuilding company. Responsibilities include coordinating engineering, platting, budget validation, creation and maintenance of schedules, and development from acquisition through development completion and escrow releases. The successful candidate shall have experience in most of the below duties and responsibilities.", "Duties and Responsibilities", "Project and Site Management (Lead)", "Coordinate with consultants including civil, soil, environmental and traffic engineers as required.", "Manage SWPPP compliance for each project under development.", "Create, maintain and update land development schedules weekly .", "Oversee and coordinate the activities of engineers, consultants and trade partners in the development of plans and execution of land development tasks", "Participate in preliminary site plan development with respect to grading, utilities, storm water , sanitary sewer, amenities and product line.", "Schedule and conduct pre-construction meetings with contractors, governmental agencies, utility companies and other stakeholders.", "Manage the design and installation of underground utilities by public utilities.", "Monitor contractors' and utility companies' work for construction schedule and scopes of work.", "Manage performance and maintenance escrow releases.", "Attend weekly meetings with engineers.", "o Address and resolve construction issues as they arise during development.", "Budget Management (Support)", "Participate in maintaining and updating budgets for all phases of development.", "Ability to negotiate pricing with third party trade partners.", "Review and approve invoices and reconcile against project budgets on a bi-weekly basis.", "Acquisition (Support)", "Assist in obtaining entitlement approvals", "Assist in conducting due diligence to identify risk potential.", "Systems and Reporting (Support)", "Work within internal systems to manage invoices, review budgets, review cash flow", "Assist creation and maintenance of project update reports", "Qualifications", "Bachelor's degree and/or relevant work experience is required.", "Strong written and spoken communication skills", "Proficient in Microsoft Outlook, Word, Excel", "Company Description", "Founded over 50 years ago, Lombardo Homes established its reputation as a leader in home building excellence. In over 30 communities, the privately owned and operated family business continues to set the new home building industry pace by creating exceptional new construction homes with the utmost quality, anticipating customer needs and providing customers with a new home buying experience.", "Founded over 50 years ago, Lombardo Homes established its reputation as a leader in home building excellence. In over 30 communities, the privately owned and operated family business continues to set the new home building industry pace by creating exceptional new construction homes with the utmost quality, anticipating customer needs and providing customers with a new home buying experience."]}
]